SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/common/hc32f460jcta.h
#define bM4_DMA1_LLP3_LLP17                       (*((volatile unsigned int*)(0x42A6234CUL)))
#define bM4_DMA1_LLP3_LLP18                       (*((volatile unsigned int*)(0x42A62350UL)))
#define bM4_DMA1_LLP3_LLP19                       (*((volatile unsigned int*)(0x42A62354UL)))
#define bM4_DMA1_LLP3_LLP20                       (*((volatile unsigned int*)(0x42A62358UL)))
#define bM4_DMA1_LLP3_LLP21                       (*((volatile unsigned int*)(0x42A6235CUL)))
#define bM4_DMA1_LLP3_LLP22                       (*((volatile unsigned int*)(0x42A62360UL)))
#define bM4_DMA1_LLP3_LLP23                       (*((volatile unsigned int*)(0x42A62364UL)))
#define bM4_DMA1_LLP3_LLP24                       (*((volatile unsigned int*)(0x42A62368UL)))
#define bM4_DMA1_LLP3_LLP25                       (*((volatile unsigned int*)(0x42A6236CUL)))
#define bM4_DMA1_LLP3_LLP26                       (*((volatile unsigned int*)(0x42A62370UL)))
#define bM4_DMA1_LLP3_LLP27                       (*((volatile unsigned int*)(0x42A62374UL)))
#define bM4_DMA1_LLP3_LLP28                       (*((volatile unsigned int*)(0x42A62378UL)))
#define bM4_DMA1_LLP3_LLP29                       (*((volatile unsigned int*)(0x42A6237CUL)))
#define bM4_DMA1_CH3CTL_SINC0                     (*((volatile unsigned int*)(0x42A62380UL)))
#define bM4_DMA1_CH3CTL_SINC1                     (*((volatile unsigned int*)(0x42A62384UL)))
#define bM4_DMA1_CH3CTL_DINC0                     (*((volatile unsigned int*)(0x42A62388UL)))
#define bM4_DMA1_CH3CTL_DINC1                     (*((volatile unsigned int*)(0x42A6238CUL)))
#define bM4_DMA1_CH3CTL_SRPTEN                    (*((volatile unsigned int*)(0x42A62390UL)))
#define bM4_DMA1_CH3CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A62394UL)))
#define bM4_DMA1_CH3CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A62398UL)))
#define bM4_DMA1_CH3CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A6239CUL)))
#define bM4_DMA1_CH3CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A623A0UL)))
#define bM4_DMA1_CH3CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A623A4UL)))
#define bM4_DMA1_CH3CTL_LLPEN                     (*((volatile unsigned int*)(0x42A623A8UL)))
#define bM4_DMA1_CH3CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A623ACUL)))
#define bM4_DMA1_CH3CTL_IE                        (*((volatile unsigned int*)(0x42A623B0UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE0               (*((volatile unsigned int*)(0x42A62500UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE1               (*((volatile unsigned int*)(0x42A62504UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE2               (*((volatile unsigned int*)(0x42A62508UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE3               (*((volatile unsigned int*)(0x42A6250CUL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE4               (*((volatile unsigned int*)(0x42A62510UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE5               (*((volatile unsigned int*)(0x42A62514UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE6               (*((volatile unsigned int*)(0x42A62518UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE7               (*((volatile unsigned int*)(0x42A6251CUL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE8               (*((volatile unsigned int*)(0x42A62520UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE9               (*((volatile unsigned int*)(0x42A62524UL)))
#define bM4_DMA1_MONDTCTL3_CNT0                   (*((volatile unsigned int*)(0x42A62540UL)))
#define bM4_DMA1_MONDTCTL3_CNT1                   (*((volatile unsigned int*)(0x42A62544UL)))
#define bM4_DMA1_MONDTCTL3_CNT2                   (*((volatile unsigned int*)(0x42A62548UL)))
#define bM4_DMA1_MONDTCTL3_CNT3                   (*((volatile unsigned int*)(0x42A6254CUL)))
#define bM4_DMA1_MONDTCTL3_CNT4                   (*((volatile unsigned int*)(0x42A62550UL)))
#define bM4_DMA1_MONDTCTL3_CNT5                   (*((volatile unsigned int*)(0x42A62554UL)))
#define bM4_DMA1_MONDTCTL3_CNT6                   (*((volatile unsigned int*)(0x42A62558UL)))
#define bM4_DMA1_MONDTCTL3_CNT7                   (*((volatile unsigned int*)(0x42A6255CUL)))
#define bM4_DMA1_MONDTCTL3_CNT8                   (*((volatile unsigned int*)(0x42A62560UL)))
#define bM4_DMA1_MONDTCTL3_CNT9                   (*((volatile unsigned int*)(0x42A62564UL)))
#define bM4_DMA1_MONDTCTL3_CNT10                  (*((volatile unsigned int*)(0x42A62568UL)))
#define bM4_DMA1_MONDTCTL3_CNT11                  (*((volatile unsigned int*)(0x42A6256CUL)))
#define bM4_DMA1_MONDTCTL3_CNT12                  (*((volatile unsigned int*)(0x42A62570UL)))
#define bM4_DMA1_MONDTCTL3_CNT13                  (*((volatile unsigned int*)(0x42A62574UL)))
#define bM4_DMA1_MONDTCTL3_CNT14                  (*((volatile unsigned int*)(0x42A62578UL)))
#define bM4_DMA1_MONDTCTL3_CNT15                  (*((volatile unsigned int*)(0x42A6257CUL)))
#define bM4_DMA1_MONRPT3_SRPT0                    (*((volatile unsigned int*)(0x42A62580UL)))
#define bM4_DMA1_MONRPT3_SRPT1                    (*((volatile unsigned int*)(0x42A62584UL)))
#define bM4_DMA1_MONRPT3_SRPT2                    (*((volatile unsigned int*)(0x42A62588UL)))
#define bM4_DMA1_MONRPT3_SRPT3                    (*((volatile unsigned int*)(0x42A6258CUL)))
#define bM4_DMA1_MONRPT3_SRPT4                    (*((volatile unsigned int*)(0x42A62590UL)))
#define bM4_DMA1_MONRPT3_SRPT5                    (*((volatile unsigned int*)(0x42A62594UL)))
#define bM4_DMA1_MONRPT3_SRPT6                    (*((volatile unsigned int*)(0x42A62598UL)))
#define bM4_DMA1_MONRPT3_SRPT7                    (*((volatile unsigned int*)(0x42A6259CUL)))
#define bM4_DMA1_MONRPT3_SRPT8                    (*((volatile unsigned int*)(0x42A625A0UL)))
#define bM4_DMA1_MONRPT3_SRPT9                    (*((volatile unsigned int*)(0x42A625A4UL)))
#define bM4_DMA1_MONRPT3_DRPT0                    (*((volatile unsigned int*)(0x42A625C0UL)))
#define bM4_DMA1_MONRPT3_DRPT1                    (*((volatile unsigned int*)(0x42A625C4UL)))
#define bM4_DMA1_MONRPT3_DRPT2                    (*((volatile unsigned int*)(0x42A625C8UL)))
#define bM4_DMA1_MONRPT3_DRPT3                    (*((volatile unsigned int*)(0x42A625CCUL)))
#define bM4_DMA1_MONRPT3_DRPT4                    (*((volatile unsigned int*)(0x42A625D0UL)))
#define bM4_DMA1_MONRPT3_DRPT5                    (*((volatile unsigned int*)(0x42A625D4UL)))
#define bM4_DMA1_MONRPT3_DRPT6                    (*((volatile unsigned int*)(0x42A625D8UL)))
#define bM4_DMA1_MONRPT3_DRPT7                    (*((volatile unsigned int*)(0x42A625DCUL)))
#define bM4_DMA1_MONRPT3_DRPT8                    (*((volatile unsigned int*)(0x42A625E0UL)))
#define bM4_DMA1_MONRPT3_DRPT9                    (*((volatile unsigned int*)(0x42A625E4UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET0            (*((volatile unsigned int*)(0x42A62600UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET1            (*((volatile unsigned int*)(0x42A62604UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET2            (*((volatile unsigned int*)(0x42A62608UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET3            (*((volatile unsigned int*)(0x42A6260CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET4            (*((volatile unsigned int*)(0x42A62610UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET5            (*((volatile unsigned int*)(0x42A62614UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET6            (*((volatile unsigned int*)(0x42A62618UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET7            (*((volatile unsigned int*)(0x42A6261CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET8            (*((volatile unsigned int*)(0x42A62620UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET9            (*((volatile unsigned int*)(0x42A62624UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET10           (*((volatile unsigned int*)(0x42A62628UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET11           (*((volatile unsigned int*)(0x42A6262CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET12           (*((volatile unsigned int*)(0x42A62630UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET13           (*((volatile unsigned int*)(0x42A62634UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET14           (*((volatile unsigned int*)(0x42A62638UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET15           (*((volatile unsigned int*)(0x42A6263CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET16           (*((volatile unsigned int*)(0x42A62640UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET17           (*((volatile unsigned int*)(0x42A62644UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET18           (*((volatile unsigned int*)(0x42A62648UL)))
#define bM4_DMA1_MONSNSEQCTL3_SOFFSET19           (*((volatile unsigned int*)(0x42A6264CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT0             (*((volatile unsigned int*)(0x42A62650UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT1             (*((volatile unsigned int*)(0x42A62654UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT2             (*((volatile unsigned int*)(0x42A62658UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT3             (*((volatile unsigned int*)(0x42A6265CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT4             (*((volatile unsigned int*)(0x42A62660UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT5             (*((volatile unsigned int*)(0x42A62664UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT6             (*((volatile unsigned int*)(0x42A62668UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT7             (*((volatile unsigned int*)(0x42A6266CUL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT8             (*((volatile unsigned int*)(0x42A62670UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT9             (*((volatile unsigned int*)(0x42A62674UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT10            (*((volatile unsigned int*)(0x42A62678UL)))
#define bM4_DMA1_MONSNSEQCTL3_SNSCNT11            (*((volatile unsigned int*)(0x42A6267CUL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET0            (*((volatile unsigned int*)(0x42A62680UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET1            (*((volatile unsigned int*)(0x42A62684UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET2            (*((volatile unsigned int*)(0x42A62688UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET3            (*((volatile unsigned int*)(0x42A6268CUL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET4            (*((volatile unsigned int*)(0x42A62690UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET5            (*((volatile unsigned int*)(0x42A62694UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET6            (*((volatile unsigned int*)(0x42A62698UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET7            (*((volatile unsigned int*)(0x42A6269CUL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET8            (*((volatile unsigned int*)(0x42A626A0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET9            (*((volatile unsigned int*)(0x42A626A4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET10           (*((volatile unsigned int*)(0x42A626A8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET11           (*((volatile unsigned int*)(0x42A626ACUL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET12           (*((volatile unsigned int*)(0x42A626B0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET13           (*((volatile unsigned int*)(0x42A626B4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET14           (*((volatile unsigned int*)(0x42A626B8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET15           (*((volatile unsigned int*)(0x42A626BCUL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET16           (*((volatile unsigned int*)(0x42A626C0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET17           (*((volatile unsigned int*)(0x42A626C4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET18           (*((volatile unsigned int*)(0x42A626C8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DOFFSET19           (*((volatile unsigned int*)(0x42A626CCUL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT0             (*((volatile unsigned int*)(0x42A626D0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT1             (*((volatile unsigned int*)(0x42A626D4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT2             (*((volatile unsigned int*)(0x42A626D8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT3             (*((volatile unsigned int*)(0x42A626DCUL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT4             (*((volatile unsigned int*)(0x42A626E0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT5             (*((volatile unsigned int*)(0x42A626E4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT6             (*((volatile unsigned int*)(0x42A626E8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT7             (*((volatile unsigned int*)(0x42A626ECUL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT8             (*((volatile unsigned int*)(0x42A626F0UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT9             (*((volatile unsigned int*)(0x42A626F4UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT10            (*((volatile unsigned int*)(0x42A626F8UL)))
#define bM4_DMA1_MONDNSEQCTL3_DNSCNT11            (*((volatile unsigned int*)(0x42A626FCUL)))
#define bM4_DMA2_EN_EN                            (*((volatile unsigned int*)(0x42A68000UL)))
#define bM4_DMA2_INTSTAT0_TRNERR0                 (*((volatile unsigned int*)(0x42A68080UL)))
#define bM4_DMA2_INTSTAT0_TRNERR1                 (*((volatile unsigned int*)(0x42A68084UL)))
#define bM4_DMA2_INTSTAT0_TRNERR2                 (*((volatile unsigned int*)(0x42A68088UL)))
#define bM4_DMA2_INTSTAT0_TRNERR3                 (*((volatile unsigned int*)(0x42A6808CUL)))
#define bM4_DMA2_INTSTAT0_REQERR0                 (*((volatile unsigned int*)(0x42A680C0UL)))
#define bM4_DMA2_INTSTAT0_REQERR1                 (*((volatile unsigned int*)(0x42A680C4UL)))
#define bM4_DMA2_INTSTAT0_REQERR2                 (*((volatile unsigned int*)(0x42A680C8UL)))
#define bM4_DMA2_INTSTAT0_REQERR3                 (*((volatile unsigned int*)(0x42A680CCUL)))
#define bM4_DMA2_INTSTAT1_TC0                     (*((volatile unsigned int*)(0x42A68100UL)))
#define bM4_DMA2_INTSTAT1_TC1                     (*((volatile unsigned int*)(0x42A68104UL)))
#define bM4_DMA2_INTSTAT1_TC2                     (*((volatile unsigned int*)(0x42A68108UL)))
#define bM4_DMA2_INTSTAT1_TC3                     (*((volatile unsigned int*)(0x42A6810CUL)))
#define bM4_DMA2_INTSTAT1_BTC0                    (*((volatile unsigned int*)(0x42A68140UL)))
#define bM4_DMA2_INTSTAT1_BTC1                    (*((volatile unsigned int*)(0x42A68144UL)))
#define bM4_DMA2_INTSTAT1_BTC2                    (*((volatile unsigned int*)(0x42A68148UL)))
#define bM4_DMA2_INTSTAT1_BTC3                    (*((volatile unsigned int*)(0x42A6814CUL)))
#define bM4_DMA2_INTMASK0_MSKTRNERR0              (*((volatile unsigned int*)(0x42A68180UL)))
#define bM4_DMA2_INTMASK0_MSKTRNERR1              (*((volatile unsigned int*)(0x42A68184UL)))
#define bM4_DMA2_INTMASK0_MSKTRNERR2              (*((volatile unsigned int*)(0x42A68188UL)))
#define bM4_DMA2_INTMASK0_MSKTRNERR3              (*((volatile unsigned int*)(0x42A6818CUL)))
#define bM4_DMA2_INTMASK0_MSKREQERR0              (*((volatile unsigned int*)(0x42A681C0UL)))
#define bM4_DMA2_INTMASK0_MSKREQERR1              (*((volatile unsigned int*)(0x42A681C4UL)))
#define bM4_DMA2_INTMASK0_MSKREQERR2              (*((volatile unsigned int*)(0x42A681C8UL)))
#define bM4_DMA2_INTMASK0_MSKREQERR3              (*((volatile unsigned int*)(0x42A681CCUL)))
#define bM4_DMA2_INTMASK1_MSKTC0                  (*((volatile unsigned int*)(0x42A68200UL)))
#define bM4_DMA2_INTMASK1_MSKTC1                  (*((volatile unsigned int*)(0x42A68204UL)))
#define bM4_DMA2_INTMASK1_MSKTC2                  (*((volatile unsigned int*)(0x42A68208UL)))
#define bM4_DMA2_INTMASK1_MSKTC3                  (*((volatile unsigned int*)(0x42A6820CUL)))
#define bM4_DMA2_INTMASK1_MSKBTC0                 (*((volatile unsigned int*)(0x42A68240UL)))
#define bM4_DMA2_INTMASK1_MSKBTC1                 (*((volatile unsigned int*)(0x42A68244UL)))
#define bM4_DMA2_INTMASK1_MSKBTC2                 (*((volatile unsigned int*)(0x42A68248UL)))
#define bM4_DMA2_INTMASK1_MSKBTC3                 (*((volatile unsigned int*)(0x42A6824CUL)))
#define bM4_DMA2_INTCLR0_CLRTRNERR0               (*((volatile unsigned int*)(0x42A68280UL)))
#define bM4_DMA2_INTCLR0_CLRTRNERR1               (*((volatile unsigned int*)(0x42A68284UL)))
#define bM4_DMA2_INTCLR0_CLRTRNERR2               (*((volatile unsigned int*)(0x42A68288UL)))
#define bM4_DMA2_INTCLR0_CLRTRNERR3               (*((volatile unsigned int*)(0x42A6828CUL)))
#define bM4_DMA2_INTCLR0_CLRREQERR0               (*((volatile unsigned int*)(0x42A682C0UL)))
#define bM4_DMA2_INTCLR0_CLRREQERR1               (*((volatile unsigned int*)(0x42A682C4UL)))
#define bM4_DMA2_INTCLR0_CLRREQERR2               (*((volatile unsigned int*)(0x42A682C8UL)))
#define bM4_DMA2_INTCLR0_CLRREQERR3               (*((volatile unsigned int*)(0x42A682CCUL)))
#define bM4_DMA2_INTCLR1_CLRTC0                   (*((volatile unsigned int*)(0x42A68300UL)))
#define bM4_DMA2_INTCLR1_CLRTC1                   (*((volatile unsigned int*)(0x42A68304UL)))
#define bM4_DMA2_INTCLR1_CLRTC2                   (*((volatile unsigned int*)(0x42A68308UL)))
#define bM4_DMA2_INTCLR1_CLRTC3                   (*((volatile unsigned int*)(0x42A6830CUL)))
#define bM4_DMA2_INTCLR1_CLRBTC0                  (*((volatile unsigned int*)(0x42A68340UL)))
#define bM4_DMA2_INTCLR1_CLRBTC1                  (*((volatile unsigned int*)(0x42A68344UL)))
#define bM4_DMA2_INTCLR1_CLRBTC2                  (*((volatile unsigned int*)(0x42A68348UL)))
#define bM4_DMA2_INTCLR1_CLRBTC3                  (*((volatile unsigned int*)(0x42A6834CUL)))
#define bM4_DMA2_CHEN_CHEN0                       (*((volatile unsigned int*)(0x42A68380UL)))
#define bM4_DMA2_CHEN_CHEN1                       (*((volatile unsigned int*)(0x42A68384UL)))
#define bM4_DMA2_CHEN_CHEN2                       (*((volatile unsigned int*)(0x42A68388UL)))
#define bM4_DMA2_CHEN_CHEN3                       (*((volatile unsigned int*)(0x42A6838CUL)))
#define bM4_DMA2_CHSTAT_DMAACT                    (*((volatile unsigned int*)(0x42A68480UL)))
#define bM4_DMA2_CHSTAT_RCFGACT                   (*((volatile unsigned int*)(0x42A68484UL)))
#define bM4_DMA2_CHSTAT_CHACT0                    (*((volatile unsigned int*)(0x42A684C0UL)))
#define bM4_DMA2_CHSTAT_CHACT1                    (*((volatile unsigned int*)(0x42A684C4UL)))
#define bM4_DMA2_CHSTAT_CHACT2                    (*((volatile unsigned int*)(0x42A684C8UL)))
#define bM4_DMA2_CHSTAT_CHACT3                    (*((volatile unsigned int*)(0x42A684CCUL)))
#define bM4_DMA2_RCFGCTL_RCFGEN                   (*((volatile unsigned int*)(0x42A68580UL)))
#define bM4_DMA2_RCFGCTL_RCFGLLP                  (*((volatile unsigned int*)(0x42A68584UL)))
#define bM4_DMA2_RCFGCTL_RCFGCHS0                 (*((volatile unsigned int*)(0x42A685A0UL)))
#define bM4_DMA2_RCFGCTL_RCFGCHS1                 (*((volatile unsigned int*)(0x42A685A4UL)))
#define bM4_DMA2_RCFGCTL_RCFGCHS2                 (*((volatile unsigned int*)(0x42A685A8UL)))
#define bM4_DMA2_RCFGCTL_RCFGCHS3                 (*((volatile unsigned int*)(0x42A685ACUL)))
#define bM4_DMA2_RCFGCTL_SARMD0                   (*((volatile unsigned int*)(0x42A685C0UL)))
#define bM4_DMA2_RCFGCTL_SARMD1                   (*((volatile unsigned int*)(0x42A685C4UL)))
#define bM4_DMA2_RCFGCTL_DARMD0                   (*((volatile unsigned int*)(0x42A685C8UL)))
#define bM4_DMA2_RCFGCTL_DARMD1                   (*((volatile unsigned int*)(0x42A685CCUL)))
#define bM4_DMA2_RCFGCTL_CNTMD0                   (*((volatile unsigned int*)(0x42A685D0UL)))
#define bM4_DMA2_RCFGCTL_CNTMD1                   (*((volatile unsigned int*)(0x42A685D4UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE0                  (*((volatile unsigned int*)(0x42A68900UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE1                  (*((volatile unsigned int*)(0x42A68904UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE2                  (*((volatile unsigned int*)(0x42A68908UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6890CUL)))
#define bM4_DMA2_DTCTL0_BLKSIZE4                  (*((volatile unsigned int*)(0x42A68910UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE5                  (*((volatile unsigned int*)(0x42A68914UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE6                  (*((volatile unsigned int*)(0x42A68918UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6891CUL)))
#define bM4_DMA2_DTCTL0_BLKSIZE8                  (*((volatile unsigned int*)(0x42A68920UL)))
#define bM4_DMA2_DTCTL0_BLKSIZE9                  (*((volatile unsigned int*)(0x42A68924UL)))
#define bM4_DMA2_DTCTL0_CNT0                      (*((volatile unsigned int*)(0x42A68940UL)))
#define bM4_DMA2_DTCTL0_CNT1                      (*((volatile unsigned int*)(0x42A68944UL)))
#define bM4_DMA2_DTCTL0_CNT2                      (*((volatile unsigned int*)(0x42A68948UL)))
#define bM4_DMA2_DTCTL0_CNT3                      (*((volatile unsigned int*)(0x42A6894CUL)))
#define bM4_DMA2_DTCTL0_CNT4                      (*((volatile unsigned int*)(0x42A68950UL)))
#define bM4_DMA2_DTCTL0_CNT5                      (*((volatile unsigned int*)(0x42A68954UL)))
#define bM4_DMA2_DTCTL0_CNT6                      (*((volatile unsigned int*)(0x42A68958UL)))
#define bM4_DMA2_DTCTL0_CNT7                      (*((volatile unsigned int*)(0x42A6895CUL)))
#define bM4_DMA2_DTCTL0_CNT8                      (*((volatile unsigned int*)(0x42A68960UL)))
#define bM4_DMA2_DTCTL0_CNT9                      (*((volatile unsigned int*)(0x42A68964UL)))
#define bM4_DMA2_DTCTL0_CNT10                     (*((volatile unsigned int*)(0x42A68968UL)))
#define bM4_DMA2_DTCTL0_CNT11                     (*((volatile unsigned int*)(0x42A6896CUL)))
#define bM4_DMA2_DTCTL0_CNT12                     (*((volatile unsigned int*)(0x42A68970UL)))
#define bM4_DMA2_DTCTL0_CNT13                     (*((volatile unsigned int*)(0x42A68974UL)))
#define bM4_DMA2_DTCTL0_CNT14                     (*((volatile unsigned int*)(0x42A68978UL)))
#define bM4_DMA2_DTCTL0_CNT15                     (*((volatile unsigned int*)(0x42A6897CUL)))
#define bM4_DMA2_RPT0_SRPT0                       (*((volatile unsigned int*)(0x42A68980UL)))
#define bM4_DMA2_RPT0_SRPT1                       (*((volatile unsigned int*)(0x42A68984UL)))
#define bM4_DMA2_RPT0_SRPT2                       (*((volatile unsigned int*)(0x42A68988UL)))
#define bM4_DMA2_RPT0_SRPT3                       (*((volatile unsigned int*)(0x42A6898CUL)))
#define bM4_DMA2_RPT0_SRPT4                       (*((volatile unsigned int*)(0x42A68990UL)))
#define bM4_DMA2_RPT0_SRPT5                       (*((volatile unsigned int*)(0x42A68994UL)))
#define bM4_DMA2_RPT0_SRPT6                       (*((volatile unsigned int*)(0x42A68998UL)))
#define bM4_DMA2_RPT0_SRPT7                       (*((volatile unsigned int*)(0x42A6899CUL)))
#define bM4_DMA2_RPT0_SRPT8                       (*((volatile unsigned int*)(0x42A689A0UL)))
#define bM4_DMA2_RPT0_SRPT9                       (*((volatile unsigned int*)(0x42A689A4UL)))
#define bM4_DMA2_RPT0_DRPT0                       (*((volatile unsigned int*)(0x42A689C0UL)))
#define bM4_DMA2_RPT0_DRPT1                       (*((volatile unsigned int*)(0x42A689C4UL)))
#define bM4_DMA2_RPT0_DRPT2                       (*((volatile unsigned int*)(0x42A689C8UL)))
#define bM4_DMA2_RPT0_DRPT3                       (*((volatile unsigned int*)(0x42A689CCUL)))
#define bM4_DMA2_RPT0_DRPT4                       (*((volatile unsigned int*)(0x42A689D0UL)))
#define bM4_DMA2_RPT0_DRPT5                       (*((volatile unsigned int*)(0x42A689D4UL)))
#define bM4_DMA2_RPT0_DRPT6                       (*((volatile unsigned int*)(0x42A689D8UL)))
#define bM4_DMA2_RPT0_DRPT7                       (*((volatile unsigned int*)(0x42A689DCUL)))
#define bM4_DMA2_RPT0_DRPT8                       (*((volatile unsigned int*)(0x42A689E0UL)))
#define bM4_DMA2_RPT0_DRPT9                       (*((volatile unsigned int*)(0x42A689E4UL)))
#define bM4_DMA2_RPTB0_SRPTB0                     (*((volatile unsigned int*)(0x42A68980UL)))
#define bM4_DMA2_RPTB0_SRPTB1                     (*((volatile unsigned int*)(0x42A68984UL)))
