SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/common/hc32f460jcta.h
#define bM4_TMRA6_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422C880CUL)))
#define bM4_TMRA6_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422C8810UL)))
#define bM4_TMRA6_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422C8814UL)))
#define bM4_TMRA6_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422C8818UL)))
#define bM4_TMRA6_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422C881CUL)))
#define bM4_TMRA6_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422C8820UL)))
#define bM4_TMRA6_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422C8824UL)))
#define bM4_TMRA6_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422C8828UL)))
#define bM4_TMRA6_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422C882CUL)))
#define bM4_TMRA6_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422C8830UL)))
#define bM4_TMRA6_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422C8834UL)))
#define bM4_TMRA6_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422C8838UL)))
#define bM4_TMRA6_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422C883CUL)))
#define bM4_TMRA6_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422C8880UL)))
#define bM4_TMRA6_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422C8884UL)))
#define bM4_TMRA6_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422C8888UL)))
#define bM4_TMRA6_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422C888CUL)))
#define bM4_TMRA6_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422C8890UL)))
#define bM4_TMRA6_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422C8894UL)))
#define bM4_TMRA6_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422C8898UL)))
#define bM4_TMRA6_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422C889CUL)))
#define bM4_TMRA6_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422C88A0UL)))
#define bM4_TMRA6_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422C88A4UL)))
#define bM4_TMRA6_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422C88A8UL)))
#define bM4_TMRA6_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422C88ACUL)))
#define bM4_TMRA6_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422C88B0UL)))
#define bM4_TMRA6_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422C88B4UL)))
#define bM4_TMRA6_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422C88B8UL)))
#define bM4_TMRA6_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422C88BCUL)))
#define bM4_TMRA6_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422C8900UL)))
#define bM4_TMRA6_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422C8904UL)))
#define bM4_TMRA6_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422C8908UL)))
#define bM4_TMRA6_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422C890CUL)))
#define bM4_TMRA6_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422C8910UL)))
#define bM4_TMRA6_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422C8914UL)))
#define bM4_TMRA6_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422C8918UL)))
#define bM4_TMRA6_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422C891CUL)))
#define bM4_TMRA6_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422C8920UL)))
#define bM4_TMRA6_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422C8924UL)))
#define bM4_TMRA6_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422C8928UL)))
#define bM4_TMRA6_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422C892CUL)))
#define bM4_TMRA6_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422C8930UL)))
#define bM4_TMRA6_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422C8934UL)))
#define bM4_TMRA6_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422C8938UL)))
#define bM4_TMRA6_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422C893CUL)))
#define bM4_TMRA6_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422C8980UL)))
#define bM4_TMRA6_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422C8984UL)))
#define bM4_TMRA6_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422C8988UL)))
#define bM4_TMRA6_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422C898CUL)))
#define bM4_TMRA6_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422C8990UL)))
#define bM4_TMRA6_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422C8994UL)))
#define bM4_TMRA6_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422C8998UL)))
#define bM4_TMRA6_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422C899CUL)))
#define bM4_TMRA6_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422C89A0UL)))
#define bM4_TMRA6_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422C89A4UL)))
#define bM4_TMRA6_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422C89A8UL)))
#define bM4_TMRA6_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422C89ACUL)))
#define bM4_TMRA6_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422C89B0UL)))
#define bM4_TMRA6_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422C89B4UL)))
#define bM4_TMRA6_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422C89B8UL)))
#define bM4_TMRA6_CMPAR4_CMP15                    (*((volatile unsigned int*)(0x422C89BCUL)))
#define bM4_TMRA6_CMPAR5_CMP0                     (*((volatile unsigned int*)(0x422C8A00UL)))
#define bM4_TMRA6_CMPAR5_CMP1                     (*((volatile unsigned int*)(0x422C8A04UL)))
#define bM4_TMRA6_CMPAR5_CMP2                     (*((volatile unsigned int*)(0x422C8A08UL)))
#define bM4_TMRA6_CMPAR5_CMP3                     (*((volatile unsigned int*)(0x422C8A0CUL)))
#define bM4_TMRA6_CMPAR5_CMP4                     (*((volatile unsigned int*)(0x422C8A10UL)))
#define bM4_TMRA6_CMPAR5_CMP5                     (*((volatile unsigned int*)(0x422C8A14UL)))
#define bM4_TMRA6_CMPAR5_CMP6                     (*((volatile unsigned int*)(0x422C8A18UL)))
#define bM4_TMRA6_CMPAR5_CMP7                     (*((volatile unsigned int*)(0x422C8A1CUL)))
#define bM4_TMRA6_CMPAR5_CMP8                     (*((volatile unsigned int*)(0x422C8A20UL)))
#define bM4_TMRA6_CMPAR5_CMP9                     (*((volatile unsigned int*)(0x422C8A24UL)))
#define bM4_TMRA6_CMPAR5_CMP10                    (*((volatile unsigned int*)(0x422C8A28UL)))
#define bM4_TMRA6_CMPAR5_CMP11                    (*((volatile unsigned int*)(0x422C8A2CUL)))
#define bM4_TMRA6_CMPAR5_CMP12                    (*((volatile unsigned int*)(0x422C8A30UL)))
#define bM4_TMRA6_CMPAR5_CMP13                    (*((volatile unsigned int*)(0x422C8A34UL)))
#define bM4_TMRA6_CMPAR5_CMP14                    (*((volatile unsigned int*)(0x422C8A38UL)))
#define bM4_TMRA6_CMPAR5_CMP15                    (*((volatile unsigned int*)(0x422C8A3CUL)))
#define bM4_TMRA6_CMPAR6_CMP0                     (*((volatile unsigned int*)(0x422C8A80UL)))
#define bM4_TMRA6_CMPAR6_CMP1                     (*((volatile unsigned int*)(0x422C8A84UL)))
#define bM4_TMRA6_CMPAR6_CMP2                     (*((volatile unsigned int*)(0x422C8A88UL)))
#define bM4_TMRA6_CMPAR6_CMP3                     (*((volatile unsigned int*)(0x422C8A8CUL)))
#define bM4_TMRA6_CMPAR6_CMP4                     (*((volatile unsigned int*)(0x422C8A90UL)))
#define bM4_TMRA6_CMPAR6_CMP5                     (*((volatile unsigned int*)(0x422C8A94UL)))
#define bM4_TMRA6_CMPAR6_CMP6                     (*((volatile unsigned int*)(0x422C8A98UL)))
#define bM4_TMRA6_CMPAR6_CMP7                     (*((volatile unsigned int*)(0x422C8A9CUL)))
#define bM4_TMRA6_CMPAR6_CMP8                     (*((volatile unsigned int*)(0x422C8AA0UL)))
#define bM4_TMRA6_CMPAR6_CMP9                     (*((volatile unsigned int*)(0x422C8AA4UL)))
#define bM4_TMRA6_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422C8AA8UL)))
#define bM4_TMRA6_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422C8AACUL)))
#define bM4_TMRA6_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422C8AB0UL)))
#define bM4_TMRA6_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422C8AB4UL)))
#define bM4_TMRA6_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422C8AB8UL)))
#define bM4_TMRA6_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422C8ABCUL)))
#define bM4_TMRA6_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422C8B00UL)))
#define bM4_TMRA6_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422C8B04UL)))
#define bM4_TMRA6_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422C8B08UL)))
#define bM4_TMRA6_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422C8B0CUL)))
#define bM4_TMRA6_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422C8B10UL)))
#define bM4_TMRA6_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422C8B14UL)))
#define bM4_TMRA6_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422C8B18UL)))
#define bM4_TMRA6_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422C8B1CUL)))
#define bM4_TMRA6_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422C8B20UL)))
#define bM4_TMRA6_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422C8B24UL)))
#define bM4_TMRA6_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422C8B28UL)))
#define bM4_TMRA6_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422C8B2CUL)))
#define bM4_TMRA6_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422C8B30UL)))
#define bM4_TMRA6_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422C8B34UL)))
#define bM4_TMRA6_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422C8B38UL)))
#define bM4_TMRA6_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422C8B3CUL)))
#define bM4_TMRA6_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422C8B80UL)))
#define bM4_TMRA6_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422C8B84UL)))
#define bM4_TMRA6_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422C8B88UL)))
#define bM4_TMRA6_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422C8B8CUL)))
#define bM4_TMRA6_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422C8B90UL)))
#define bM4_TMRA6_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422C8B94UL)))
#define bM4_TMRA6_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422C8B98UL)))
#define bM4_TMRA6_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422C8B9CUL)))
#define bM4_TMRA6_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422C8BA0UL)))
#define bM4_TMRA6_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422C8BA4UL)))
#define bM4_TMRA6_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422C8BA8UL)))
#define bM4_TMRA6_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422C8BACUL)))
#define bM4_TMRA6_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422C8BB0UL)))
#define bM4_TMRA6_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422C8BB4UL)))
#define bM4_TMRA6_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422C8BB8UL)))
#define bM4_TMRA6_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422C8BBCUL)))
#define bM4_TMRA6_BCSTR_START                     (*((volatile unsigned int*)(0x422C9000UL)))
#define bM4_TMRA6_BCSTR_DIR                       (*((volatile unsigned int*)(0x422C9004UL)))
#define bM4_TMRA6_BCSTR_MODE                      (*((volatile unsigned int*)(0x422C9008UL)))
#define bM4_TMRA6_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422C900CUL)))
#define bM4_TMRA6_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422C9010UL)))
#define bM4_TMRA6_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422C9014UL)))
#define bM4_TMRA6_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422C9018UL)))
#define bM4_TMRA6_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422C901CUL)))
#define bM4_TMRA6_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422C9030UL)))
#define bM4_TMRA6_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422C9034UL)))
#define bM4_TMRA6_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422C9038UL)))
#define bM4_TMRA6_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422C903CUL)))
#define bM4_TMRA6_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422C9080UL)))
#define bM4_TMRA6_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422C9084UL)))
#define bM4_TMRA6_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422C9088UL)))
#define bM4_TMRA6_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422C9090UL)))
#define bM4_TMRA6_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422C9094UL)))
#define bM4_TMRA6_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422C9098UL)))
#define bM4_TMRA6_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422C90A0UL)))
#define bM4_TMRA6_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422C90A4UL)))
#define bM4_TMRA6_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422C90A8UL)))
#define bM4_TMRA6_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422C90B0UL)))
#define bM4_TMRA6_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422C90B4UL)))
#define bM4_TMRA6_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422C90B8UL)))
#define bM4_TMRA6_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422C90BCUL)))
#define bM4_TMRA6_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422C9100UL)))
#define bM4_TMRA6_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422C9104UL)))
#define bM4_TMRA6_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422C9108UL)))
#define bM4_TMRA6_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422C910CUL)))
#define bM4_TMRA6_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422C9110UL)))
#define bM4_TMRA6_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422C9114UL)))
#define bM4_TMRA6_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422C9118UL)))
#define bM4_TMRA6_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422C911CUL)))
#define bM4_TMRA6_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422C9120UL)))
#define bM4_TMRA6_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422C9124UL)))
#define bM4_TMRA6_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422C9128UL)))
#define bM4_TMRA6_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422C912CUL)))
#define bM4_TMRA6_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422C9130UL)))
#define bM4_TMRA6_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422C9180UL)))
#define bM4_TMRA6_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422C9184UL)))
#define bM4_TMRA6_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422C9188UL)))
#define bM4_TMRA6_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422C918CUL)))
#define bM4_TMRA6_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422C9190UL)))
#define bM4_TMRA6_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422C9194UL)))
#define bM4_TMRA6_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422C9198UL)))
#define bM4_TMRA6_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422C919CUL)))
#define bM4_TMRA6_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422C91A0UL)))
#define bM4_TMRA6_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422C91A4UL)))
#define bM4_TMRA6_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422C91A8UL)))
#define bM4_TMRA6_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422C91ACUL)))
#define bM4_TMRA6_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422C91B0UL)))
#define bM4_TMRA6_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422C9200UL)))
#define bM4_TMRA6_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422C9204UL)))
#define bM4_TMRA6_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422C9208UL)))
#define bM4_TMRA6_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422C920CUL)))
#define bM4_TMRA6_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422C9210UL)))
#define bM4_TMRA6_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422C9214UL)))
#define bM4_TMRA6_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422C9218UL)))
#define bM4_TMRA6_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422C921CUL)))
#define bM4_TMRA6_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422C9280UL)))
#define bM4_TMRA6_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422C9284UL)))
#define bM4_TMRA6_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422C9288UL)))
#define bM4_TMRA6_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422C928CUL)))
#define bM4_TMRA6_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422C9290UL)))
#define bM4_TMRA6_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422C9294UL)))
#define bM4_TMRA6_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422C9298UL)))
#define bM4_TMRA6_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422C929CUL)))
#define bM4_TMRA6_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422C9300UL)))
#define bM4_TMRA6_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422C9304UL)))
#define bM4_TMRA6_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422C9308UL)))
#define bM4_TMRA6_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422C9320UL)))
#define bM4_TMRA6_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422C9324UL)))
#define bM4_TMRA6_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422C9328UL)))
#define bM4_TMRA6_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422C9330UL)))
#define bM4_TMRA6_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422C9334UL)))
#define bM4_TMRA6_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422C9338UL)))
#define bM4_TMRA6_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422C9380UL)))
#define bM4_TMRA6_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422C9384UL)))
#define bM4_TMRA6_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422C9388UL)))
#define bM4_TMRA6_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422C938CUL)))
#define bM4_TMRA6_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422C9390UL)))
#define bM4_TMRA6_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422C9394UL)))
#define bM4_TMRA6_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422C9398UL)))
#define bM4_TMRA6_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422C939CUL)))
#define bM4_TMRA6_BCONR1_BEN                      (*((volatile unsigned int*)(0x422C9800UL)))
#define bM4_TMRA6_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422C9804UL)))
#define bM4_TMRA6_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422C9808UL)))
#define bM4_TMRA6_BCONR2_BEN                      (*((volatile unsigned int*)(0x422C9900UL)))
#define bM4_TMRA6_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422C9904UL)))
#define bM4_TMRA6_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422C9908UL)))
#define bM4_TMRA6_BCONR3_BEN                      (*((volatile unsigned int*)(0x422C9A00UL)))
#define bM4_TMRA6_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422C9A04UL)))
#define bM4_TMRA6_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422C9A08UL)))
#define bM4_TMRA6_BCONR4_BEN                      (*((volatile unsigned int*)(0x422C9B00UL)))
#define bM4_TMRA6_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422C9B04UL)))
#define bM4_TMRA6_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422C9B08UL)))
#define bM4_TMRA6_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422CA000UL)))
#define bM4_TMRA6_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422CA010UL)))
#define bM4_TMRA6_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422CA014UL)))
#define bM4_TMRA6_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422CA018UL)))
#define bM4_TMRA6_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422CA020UL)))
#define bM4_TMRA6_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422CA024UL)))
#define bM4_TMRA6_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422CA030UL)))
#define bM4_TMRA6_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422CA034UL)))
#define bM4_TMRA6_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422CA038UL)))
#define bM4_TMRA6_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422CA080UL)))
#define bM4_TMRA6_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422CA090UL)))
#define bM4_TMRA6_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422CA094UL)))
#define bM4_TMRA6_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422CA098UL)))
#define bM4_TMRA6_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422CA0A0UL)))
#define bM4_TMRA6_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422CA0A4UL)))
#define bM4_TMRA6_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422CA0B0UL)))
#define bM4_TMRA6_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422CA0B4UL)))
#define bM4_TMRA6_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422CA0B8UL)))
#define bM4_TMRA6_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422CA100UL)))
#define bM4_TMRA6_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422CA110UL)))
#define bM4_TMRA6_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422CA114UL)))
#define bM4_TMRA6_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422CA118UL)))
#define bM4_TMRA6_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422CA120UL)))
#define bM4_TMRA6_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422CA124UL)))
#define bM4_TMRA6_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422CA130UL)))
#define bM4_TMRA6_CCONR3_NOFICKCP0                (*((volatile unsigned int*)(0x422CA134UL)))
#define bM4_TMRA6_CCONR3_NOFICKCP1                (*((volatile unsigned int*)(0x422CA138UL)))
#define bM4_TMRA6_CCONR4_CAPMD                    (*((volatile unsigned int*)(0x422CA180UL)))
#define bM4_TMRA6_CCONR4_HICP0                    (*((volatile unsigned int*)(0x422CA190UL)))
#define bM4_TMRA6_CCONR4_HICP1                    (*((volatile unsigned int*)(0x422CA194UL)))
#define bM4_TMRA6_CCONR4_HICP2                    (*((volatile unsigned int*)(0x422CA198UL)))
#define bM4_TMRA6_CCONR4_HICP3                    (*((volatile unsigned int*)(0x422CA1A0UL)))
#define bM4_TMRA6_CCONR4_HICP4                    (*((volatile unsigned int*)(0x422CA1A4UL)))
#define bM4_TMRA6_CCONR4_NOFIENCP                 (*((volatile unsigned int*)(0x422CA1B0UL)))
