SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/common/hc32f460jcta.h
#define bM4_USART2_CR1_TXEIE                      (*((volatile unsigned int*)(0x423A819CUL)))
#define bM4_USART2_CR1_PS                         (*((volatile unsigned int*)(0x423A81A4UL)))
#define bM4_USART2_CR1_PCE                        (*((volatile unsigned int*)(0x423A81A8UL)))
#define bM4_USART2_CR1_M                          (*((volatile unsigned int*)(0x423A81B0UL)))
#define bM4_USART2_CR1_OVER8                      (*((volatile unsigned int*)(0x423A81BCUL)))
#define bM4_USART2_CR1_CPE                        (*((volatile unsigned int*)(0x423A81C0UL)))
#define bM4_USART2_CR1_CFE                        (*((volatile unsigned int*)(0x423A81C4UL)))
#define bM4_USART2_CR1_CORE                       (*((volatile unsigned int*)(0x423A81CCUL)))
#define bM4_USART2_CR1_CRTOF                      (*((volatile unsigned int*)(0x423A81D0UL)))
#define bM4_USART2_CR1_MS                         (*((volatile unsigned int*)(0x423A81E0UL)))
#define bM4_USART2_CR1_ML                         (*((volatile unsigned int*)(0x423A81F0UL)))
#define bM4_USART2_CR1_FBME                       (*((volatile unsigned int*)(0x423A81F4UL)))
#define bM4_USART2_CR1_NFE                        (*((volatile unsigned int*)(0x423A81F8UL)))
#define bM4_USART2_CR1_SBS                        (*((volatile unsigned int*)(0x423A81FCUL)))
#define bM4_USART2_CR2_MPE                        (*((volatile unsigned int*)(0x423A8200UL)))
#define bM4_USART2_CR2_CLKC0                      (*((volatile unsigned int*)(0x423A822CUL)))
#define bM4_USART2_CR2_CLKC1                      (*((volatile unsigned int*)(0x423A8230UL)))
#define bM4_USART2_CR2_STOP                       (*((volatile unsigned int*)(0x423A8234UL)))
#define bM4_USART2_CR3_SCEN                       (*((volatile unsigned int*)(0x423A8294UL)))
#define bM4_USART2_CR3_CTSE                       (*((volatile unsigned int*)(0x423A82A4UL)))
#define bM4_USART2_CR3_BCN0                       (*((volatile unsigned int*)(0x423A82D4UL)))
#define bM4_USART2_CR3_BCN1                       (*((volatile unsigned int*)(0x423A82D8UL)))
#define bM4_USART2_CR3_BCN2                       (*((volatile unsigned int*)(0x423A82DCUL)))
#define bM4_USART2_PR_PSC0                        (*((volatile unsigned int*)(0x423A8300UL)))
#define bM4_USART2_PR_PSC1                        (*((volatile unsigned int*)(0x423A8304UL)))
#define bM4_USART3_SR_PE                          (*((volatile unsigned int*)(0x42420000UL)))
#define bM4_USART3_SR_FE                          (*((volatile unsigned int*)(0x42420004UL)))
#define bM4_USART3_SR_ORE                         (*((volatile unsigned int*)(0x4242000CUL)))
#define bM4_USART3_SR_RXNE                        (*((volatile unsigned int*)(0x42420014UL)))
#define bM4_USART3_SR_TC                          (*((volatile unsigned int*)(0x42420018UL)))
#define bM4_USART3_SR_TXE                         (*((volatile unsigned int*)(0x4242001CUL)))
#define bM4_USART3_SR_RTOF                        (*((volatile unsigned int*)(0x42420020UL)))
#define bM4_USART3_SR_MPB                         (*((volatile unsigned int*)(0x42420040UL)))
#define bM4_USART3_DR_TDR0                        (*((volatile unsigned int*)(0x42420080UL)))
#define bM4_USART3_DR_TDR1                        (*((volatile unsigned int*)(0x42420084UL)))
#define bM4_USART3_DR_TDR2                        (*((volatile unsigned int*)(0x42420088UL)))
#define bM4_USART3_DR_TDR3                        (*((volatile unsigned int*)(0x4242008CUL)))
#define bM4_USART3_DR_TDR4                        (*((volatile unsigned int*)(0x42420090UL)))
#define bM4_USART3_DR_TDR5                        (*((volatile unsigned int*)(0x42420094UL)))
#define bM4_USART3_DR_TDR6                        (*((volatile unsigned int*)(0x42420098UL)))
#define bM4_USART3_DR_TDR7                        (*((volatile unsigned int*)(0x4242009CUL)))
#define bM4_USART3_DR_TDR8                        (*((volatile unsigned int*)(0x424200A0UL)))
#define bM4_USART3_DR_MPID                        (*((volatile unsigned int*)(0x424200A4UL)))
#define bM4_USART3_DR_RDR0                        (*((volatile unsigned int*)(0x424200C0UL)))
#define bM4_USART3_DR_RDR1                        (*((volatile unsigned int*)(0x424200C4UL)))
#define bM4_USART3_DR_RDR2                        (*((volatile unsigned int*)(0x424200C8UL)))
#define bM4_USART3_DR_RDR3                        (*((volatile unsigned int*)(0x424200CCUL)))
#define bM4_USART3_DR_RDR4                        (*((volatile unsigned int*)(0x424200D0UL)))
#define bM4_USART3_DR_RDR5                        (*((volatile unsigned int*)(0x424200D4UL)))
#define bM4_USART3_DR_RDR6                        (*((volatile unsigned int*)(0x424200D8UL)))
#define bM4_USART3_DR_RDR7                        (*((volatile unsigned int*)(0x424200DCUL)))
#define bM4_USART3_DR_RDR8                        (*((volatile unsigned int*)(0x424200E0UL)))
#define bM4_USART3_BRR_DIV_FRACTION0              (*((volatile unsigned int*)(0x42420100UL)))
#define bM4_USART3_BRR_DIV_FRACTION1              (*((volatile unsigned int*)(0x42420104UL)))
#define bM4_USART3_BRR_DIV_FRACTION2              (*((volatile unsigned int*)(0x42420108UL)))
#define bM4_USART3_BRR_DIV_FRACTION3              (*((volatile unsigned int*)(0x4242010CUL)))
#define bM4_USART3_BRR_DIV_FRACTION4              (*((volatile unsigned int*)(0x42420110UL)))
#define bM4_USART3_BRR_DIV_FRACTION5              (*((volatile unsigned int*)(0x42420114UL)))
#define bM4_USART3_BRR_DIV_FRACTION6              (*((volatile unsigned int*)(0x42420118UL)))
#define bM4_USART3_BRR_DIV_INTEGER0               (*((volatile unsigned int*)(0x42420120UL)))
#define bM4_USART3_BRR_DIV_INTEGER1               (*((volatile unsigned int*)(0x42420124UL)))
#define bM4_USART3_BRR_DIV_INTEGER2               (*((volatile unsigned int*)(0x42420128UL)))
#define bM4_USART3_BRR_DIV_INTEGER3               (*((volatile unsigned int*)(0x4242012CUL)))
#define bM4_USART3_BRR_DIV_INTEGER4               (*((volatile unsigned int*)(0x42420130UL)))
#define bM4_USART3_BRR_DIV_INTEGER5               (*((volatile unsigned int*)(0x42420134UL)))
#define bM4_USART3_BRR_DIV_INTEGER6               (*((volatile unsigned int*)(0x42420138UL)))
#define bM4_USART3_BRR_DIV_INTEGER7               (*((volatile unsigned int*)(0x4242013CUL)))
#define bM4_USART3_CR1_RTOE                       (*((volatile unsigned int*)(0x42420180UL)))
#define bM4_USART3_CR1_RTOIE                      (*((volatile unsigned int*)(0x42420184UL)))
#define bM4_USART3_CR1_RE                         (*((volatile unsigned int*)(0x42420188UL)))
#define bM4_USART3_CR1_TE                         (*((volatile unsigned int*)(0x4242018CUL)))
#define bM4_USART3_CR1_SLME                       (*((volatile unsigned int*)(0x42420190UL)))
#define bM4_USART3_CR1_RIE                        (*((volatile unsigned int*)(0x42420194UL)))
#define bM4_USART3_CR1_TCIE                       (*((volatile unsigned int*)(0x42420198UL)))
#define bM4_USART3_CR1_TXEIE                      (*((volatile unsigned int*)(0x4242019CUL)))
#define bM4_USART3_CR1_PS                         (*((volatile unsigned int*)(0x424201A4UL)))
#define bM4_USART3_CR1_PCE                        (*((volatile unsigned int*)(0x424201A8UL)))
#define bM4_USART3_CR1_M                          (*((volatile unsigned int*)(0x424201B0UL)))
#define bM4_USART3_CR1_OVER8                      (*((volatile unsigned int*)(0x424201BCUL)))
#define bM4_USART3_CR1_CPE                        (*((volatile unsigned int*)(0x424201C0UL)))
#define bM4_USART3_CR1_CFE                        (*((volatile unsigned int*)(0x424201C4UL)))
#define bM4_USART3_CR1_CORE                       (*((volatile unsigned int*)(0x424201CCUL)))
#define bM4_USART3_CR1_CRTOF                      (*((volatile unsigned int*)(0x424201D0UL)))
#define bM4_USART3_CR1_MS                         (*((volatile unsigned int*)(0x424201E0UL)))
#define bM4_USART3_CR1_ML                         (*((volatile unsigned int*)(0x424201F0UL)))
#define bM4_USART3_CR1_FBME                       (*((volatile unsigned int*)(0x424201F4UL)))
#define bM4_USART3_CR1_NFE                        (*((volatile unsigned int*)(0x424201F8UL)))
#define bM4_USART3_CR1_SBS                        (*((volatile unsigned int*)(0x424201FCUL)))
#define bM4_USART3_CR2_MPE                        (*((volatile unsigned int*)(0x42420200UL)))
#define bM4_USART3_CR2_CLKC0                      (*((volatile unsigned int*)(0x4242022CUL)))
#define bM4_USART3_CR2_CLKC1                      (*((volatile unsigned int*)(0x42420230UL)))
#define bM4_USART3_CR2_STOP                       (*((volatile unsigned int*)(0x42420234UL)))
#define bM4_USART3_CR3_SCEN                       (*((volatile unsigned int*)(0x42420294UL)))
#define bM4_USART3_CR3_CTSE                       (*((volatile unsigned int*)(0x424202A4UL)))
#define bM4_USART3_CR3_BCN0                       (*((volatile unsigned int*)(0x424202D4UL)))
#define bM4_USART3_CR3_BCN1                       (*((volatile unsigned int*)(0x424202D8UL)))
#define bM4_USART3_CR3_BCN2                       (*((volatile unsigned int*)(0x424202DCUL)))
#define bM4_USART3_PR_PSC0                        (*((volatile unsigned int*)(0x42420300UL)))
#define bM4_USART3_PR_PSC1                        (*((volatile unsigned int*)(0x42420304UL)))
#define bM4_USART4_SR_PE                          (*((volatile unsigned int*)(0x42428000UL)))
#define bM4_USART4_SR_FE                          (*((volatile unsigned int*)(0x42428004UL)))
#define bM4_USART4_SR_ORE                         (*((volatile unsigned int*)(0x4242800CUL)))
#define bM4_USART4_SR_RXNE                        (*((volatile unsigned int*)(0x42428014UL)))
#define bM4_USART4_SR_TC                          (*((volatile unsigned int*)(0x42428018UL)))
#define bM4_USART4_SR_TXE                         (*((volatile unsigned int*)(0x4242801CUL)))
#define bM4_USART4_SR_RTOF                        (*((volatile unsigned int*)(0x42428020UL)))
#define bM4_USART4_SR_MPB                         (*((volatile unsigned int*)(0x42428040UL)))
#define bM4_USART4_DR_TDR0                        (*((volatile unsigned int*)(0x42428080UL)))
#define bM4_USART4_DR_TDR1                        (*((volatile unsigned int*)(0x42428084UL)))
#define bM4_USART4_DR_TDR2                        (*((volatile unsigned int*)(0x42428088UL)))
#define bM4_USART4_DR_TDR3                        (*((volatile unsigned int*)(0x4242808CUL)))
#define bM4_USART4_DR_TDR4                        (*((volatile unsigned int*)(0x42428090UL)))
#define bM4_USART4_DR_TDR5                        (*((volatile unsigned int*)(0x42428094UL)))
#define bM4_USART4_DR_TDR6                        (*((volatile unsigned int*)(0x42428098UL)))
#define bM4_USART4_DR_TDR7                        (*((volatile unsigned int*)(0x4242809CUL)))
#define bM4_USART4_DR_TDR8                        (*((volatile unsigned int*)(0x424280A0UL)))
#define bM4_USART4_DR_MPID                        (*((volatile unsigned int*)(0x424280A4UL)))
#define bM4_USART4_DR_RDR0                        (*((volatile unsigned int*)(0x424280C0UL)))
#define bM4_USART4_DR_RDR1                        (*((volatile unsigned int*)(0x424280C4UL)))
#define bM4_USART4_DR_RDR2                        (*((volatile unsigned int*)(0x424280C8UL)))
#define bM4_USART4_DR_RDR3                        (*((volatile unsigned int*)(0x424280CCUL)))
#define bM4_USART4_DR_RDR4                        (*((volatile unsigned int*)(0x424280D0UL)))
#define bM4_USART4_DR_RDR5                        (*((volatile unsigned int*)(0x424280D4UL)))
#define bM4_USART4_DR_RDR6                        (*((volatile unsigned int*)(0x424280D8UL)))
#define bM4_USART4_DR_RDR7                        (*((volatile unsigned int*)(0x424280DCUL)))
#define bM4_USART4_DR_RDR8                        (*((volatile unsigned int*)(0x424280E0UL)))
#define bM4_USART4_BRR_DIV_FRACTION0              (*((volatile unsigned int*)(0x42428100UL)))
#define bM4_USART4_BRR_DIV_FRACTION1              (*((volatile unsigned int*)(0x42428104UL)))
#define bM4_USART4_BRR_DIV_FRACTION2              (*((volatile unsigned int*)(0x42428108UL)))
#define bM4_USART4_BRR_DIV_FRACTION3              (*((volatile unsigned int*)(0x4242810CUL)))
#define bM4_USART4_BRR_DIV_FRACTION4              (*((volatile unsigned int*)(0x42428110UL)))
#define bM4_USART4_BRR_DIV_FRACTION5              (*((volatile unsigned int*)(0x42428114UL)))
#define bM4_USART4_BRR_DIV_FRACTION6              (*((volatile unsigned int*)(0x42428118UL)))
#define bM4_USART4_BRR_DIV_INTEGER0               (*((volatile unsigned int*)(0x42428120UL)))
#define bM4_USART4_BRR_DIV_INTEGER1               (*((volatile unsigned int*)(0x42428124UL)))
#define bM4_USART4_BRR_DIV_INTEGER2               (*((volatile unsigned int*)(0x42428128UL)))
#define bM4_USART4_BRR_DIV_INTEGER3               (*((volatile unsigned int*)(0x4242812CUL)))
#define bM4_USART4_BRR_DIV_INTEGER4               (*((volatile unsigned int*)(0x42428130UL)))
#define bM4_USART4_BRR_DIV_INTEGER5               (*((volatile unsigned int*)(0x42428134UL)))
#define bM4_USART4_BRR_DIV_INTEGER6               (*((volatile unsigned int*)(0x42428138UL)))
#define bM4_USART4_BRR_DIV_INTEGER7               (*((volatile unsigned int*)(0x4242813CUL)))
#define bM4_USART4_CR1_RTOE                       (*((volatile unsigned int*)(0x42428180UL)))
#define bM4_USART4_CR1_RTOIE                      (*((volatile unsigned int*)(0x42428184UL)))
#define bM4_USART4_CR1_RE                         (*((volatile unsigned int*)(0x42428188UL)))
#define bM4_USART4_CR1_TE                         (*((volatile unsigned int*)(0x4242818CUL)))
#define bM4_USART4_CR1_SLME                       (*((volatile unsigned int*)(0x42428190UL)))
#define bM4_USART4_CR1_RIE                        (*((volatile unsigned int*)(0x42428194UL)))
#define bM4_USART4_CR1_TCIE                       (*((volatile unsigned int*)(0x42428198UL)))
#define bM4_USART4_CR1_TXEIE                      (*((volatile unsigned int*)(0x4242819CUL)))
#define bM4_USART4_CR1_PS                         (*((volatile unsigned int*)(0x424281A4UL)))
#define bM4_USART4_CR1_PCE                        (*((volatile unsigned int*)(0x424281A8UL)))
#define bM4_USART4_CR1_M                          (*((volatile unsigned int*)(0x424281B0UL)))
#define bM4_USART4_CR1_OVER8                      (*((volatile unsigned int*)(0x424281BCUL)))
#define bM4_USART4_CR1_CPE                        (*((volatile unsigned int*)(0x424281C0UL)))
#define bM4_USART4_CR1_CFE                        (*((volatile unsigned int*)(0x424281C4UL)))
#define bM4_USART4_CR1_CORE                       (*((volatile unsigned int*)(0x424281CCUL)))
#define bM4_USART4_CR1_CRTOF                      (*((volatile unsigned int*)(0x424281D0UL)))
#define bM4_USART4_CR1_MS                         (*((volatile unsigned int*)(0x424281E0UL)))
#define bM4_USART4_CR1_ML                         (*((volatile unsigned int*)(0x424281F0UL)))
#define bM4_USART4_CR1_FBME                       (*((volatile unsigned int*)(0x424281F4UL)))
#define bM4_USART4_CR1_NFE                        (*((volatile unsigned int*)(0x424281F8UL)))
#define bM4_USART4_CR1_SBS                        (*((volatile unsigned int*)(0x424281FCUL)))
#define bM4_USART4_CR2_MPE                        (*((volatile unsigned int*)(0x42428200UL)))
#define bM4_USART4_CR2_CLKC0                      (*((volatile unsigned int*)(0x4242822CUL)))
#define bM4_USART4_CR2_CLKC1                      (*((volatile unsigned int*)(0x42428230UL)))
#define bM4_USART4_CR2_STOP                       (*((volatile unsigned int*)(0x42428234UL)))
#define bM4_USART4_CR3_SCEN                       (*((volatile unsigned int*)(0x42428294UL)))
#define bM4_USART4_CR3_CTSE                       (*((volatile unsigned int*)(0x424282A4UL)))
#define bM4_USART4_CR3_BCN0                       (*((volatile unsigned int*)(0x424282D4UL)))
#define bM4_USART4_CR3_BCN1                       (*((volatile unsigned int*)(0x424282D8UL)))
#define bM4_USART4_CR3_BCN2                       (*((volatile unsigned int*)(0x424282DCUL)))
#define bM4_USART4_PR_PSC0                        (*((volatile unsigned int*)(0x42428300UL)))
#define bM4_USART4_PR_PSC1                        (*((volatile unsigned int*)(0x42428304UL)))
#define bM4_USBFS_USBFS_GVBUSCFG_VBUSOVEN         (*((volatile unsigned int*)(0x43800018UL)))
#define bM4_USBFS_USBFS_GVBUSCFG_VBUSVAL          (*((volatile unsigned int*)(0x4380001CUL)))
#define bM4_USBFS_GAHBCFG_GINTMSK                 (*((volatile unsigned int*)(0x43800100UL)))
#define bM4_USBFS_GAHBCFG_HBSTLEN0                (*((volatile unsigned int*)(0x43800104UL)))
#define bM4_USBFS_GAHBCFG_HBSTLEN1                (*((volatile unsigned int*)(0x43800108UL)))
#define bM4_USBFS_GAHBCFG_HBSTLEN2                (*((volatile unsigned int*)(0x4380010CUL)))
#define bM4_USBFS_GAHBCFG_HBSTLEN3                (*((volatile unsigned int*)(0x43800110UL)))
#define bM4_USBFS_GAHBCFG_DMAEN                   (*((volatile unsigned int*)(0x43800114UL)))
#define bM4_USBFS_GAHBCFG_TXFELVL                 (*((volatile unsigned int*)(0x4380011CUL)))
#define bM4_USBFS_GAHBCFG_PTXFELVL                (*((volatile unsigned int*)(0x43800120UL)))
#define bM4_USBFS_GUSBCFG_TOCAL0                  (*((volatile unsigned int*)(0x43800180UL)))
#define bM4_USBFS_GUSBCFG_TOCAL1                  (*((volatile unsigned int*)(0x43800184UL)))
#define bM4_USBFS_GUSBCFG_TOCAL2                  (*((volatile unsigned int*)(0x43800188UL)))
#define bM4_USBFS_GUSBCFG_PHYSEL                  (*((volatile unsigned int*)(0x43800198UL)))
#define bM4_USBFS_GUSBCFG_TRDT0                   (*((volatile unsigned int*)(0x438001A8UL)))
#define bM4_USBFS_GUSBCFG_TRDT1                   (*((volatile unsigned int*)(0x438001ACUL)))
#define bM4_USBFS_GUSBCFG_TRDT2                   (*((volatile unsigned int*)(0x438001B0UL)))
#define bM4_USBFS_GUSBCFG_TRDT3                   (*((volatile unsigned int*)(0x438001B4UL)))
#define bM4_USBFS_GUSBCFG_FHMOD                   (*((volatile unsigned int*)(0x438001F4UL)))
#define bM4_USBFS_GUSBCFG_FDMOD                   (*((volatile unsigned int*)(0x438001F8UL)))
#define bM4_USBFS_GRSTCTL_CSRST                   (*((volatile unsigned int*)(0x43800200UL)))
#define bM4_USBFS_GRSTCTL_HSRST                   (*((volatile unsigned int*)(0x43800204UL)))
#define bM4_USBFS_GRSTCTL_FCRST                   (*((volatile unsigned int*)(0x43800208UL)))
#define bM4_USBFS_GRSTCTL_RXFFLSH                 (*((volatile unsigned int*)(0x43800210UL)))
#define bM4_USBFS_GRSTCTL_TXFFLSH                 (*((volatile unsigned int*)(0x43800214UL)))
#define bM4_USBFS_GRSTCTL_TXFNUM0                 (*((volatile unsigned int*)(0x43800218UL)))
#define bM4_USBFS_GRSTCTL_TXFNUM1                 (*((volatile unsigned int*)(0x4380021CUL)))
#define bM4_USBFS_GRSTCTL_TXFNUM2                 (*((volatile unsigned int*)(0x43800220UL)))
#define bM4_USBFS_GRSTCTL_TXFNUM3                 (*((volatile unsigned int*)(0x43800224UL)))
#define bM4_USBFS_GRSTCTL_TXFNUM4                 (*((volatile unsigned int*)(0x43800228UL)))
#define bM4_USBFS_GRSTCTL_DMAREQ                  (*((volatile unsigned int*)(0x43800278UL)))
#define bM4_USBFS_GRSTCTL_AHBIDL                  (*((volatile unsigned int*)(0x4380027CUL)))
#define bM4_USBFS_GINTSTS_CMOD                    (*((volatile unsigned int*)(0x43800280UL)))
#define bM4_USBFS_GINTSTS_MMIS                    (*((volatile unsigned int*)(0x43800284UL)))
#define bM4_USBFS_GINTSTS_SOF                     (*((volatile unsigned int*)(0x4380028CUL)))
#define bM4_USBFS_GINTSTS_RXFNE                   (*((volatile unsigned int*)(0x43800290UL)))
#define bM4_USBFS_GINTSTS_NPTXFE                  (*((volatile unsigned int*)(0x43800294UL)))
#define bM4_USBFS_GINTSTS_GINAKEFF                (*((volatile unsigned int*)(0x43800298UL)))
#define bM4_USBFS_GINTSTS_GONAKEFF                (*((volatile unsigned int*)(0x4380029CUL)))
#define bM4_USBFS_GINTSTS_ESUSP                   (*((volatile unsigned int*)(0x438002A8UL)))
#define bM4_USBFS_GINTSTS_USBSUSP                 (*((volatile unsigned int*)(0x438002ACUL)))
#define bM4_USBFS_GINTSTS_USBRST                  (*((volatile unsigned int*)(0x438002B0UL)))
#define bM4_USBFS_GINTSTS_ENUMDNE                 (*((volatile unsigned int*)(0x438002B4UL)))
#define bM4_USBFS_GINTSTS_ISOODRP                 (*((volatile unsigned int*)(0x438002B8UL)))
#define bM4_USBFS_GINTSTS_EOPF                    (*((volatile unsigned int*)(0x438002BCUL)))
#define bM4_USBFS_GINTSTS_IEPINT                  (*((volatile unsigned int*)(0x438002C8UL)))
#define bM4_USBFS_GINTSTS_OEPINT                  (*((volatile unsigned int*)(0x438002CCUL)))
#define bM4_USBFS_GINTSTS_IISOIXFR                (*((volatile unsigned int*)(0x438002D0UL)))
#define bM4_USBFS_GINTSTS_IPXFR_INCOMPISOOUT      (*((volatile unsigned int*)(0x438002D4UL)))
#define bM4_USBFS_GINTSTS_DATAFSUSP               (*((volatile unsigned int*)(0x438002D8UL)))
#define bM4_USBFS_GINTSTS_HPRTINT                 (*((volatile unsigned int*)(0x438002E0UL)))
#define bM4_USBFS_GINTSTS_HCINT                   (*((volatile unsigned int*)(0x438002E4UL)))
#define bM4_USBFS_GINTSTS_PTXFE                   (*((volatile unsigned int*)(0x438002E8UL)))
#define bM4_USBFS_GINTSTS_CIDSCHG                 (*((volatile unsigned int*)(0x438002F0UL)))
#define bM4_USBFS_GINTSTS_DISCINT                 (*((volatile unsigned int*)(0x438002F4UL)))
#define bM4_USBFS_GINTSTS_VBUSVINT                (*((volatile unsigned int*)(0x438002F8UL)))
#define bM4_USBFS_GINTSTS_WKUINT                  (*((volatile unsigned int*)(0x438002FCUL)))
#define bM4_USBFS_GINTMSK_MMISM                   (*((volatile unsigned int*)(0x43800304UL)))
#define bM4_USBFS_GINTMSK_SOFM                    (*((volatile unsigned int*)(0x4380030CUL)))
#define bM4_USBFS_GINTMSK_RXFNEM                  (*((volatile unsigned int*)(0x43800310UL)))
#define bM4_USBFS_GINTMSK_NPTXFEM                 (*((volatile unsigned int*)(0x43800314UL)))
#define bM4_USBFS_GINTMSK_GINAKEFFM               (*((volatile unsigned int*)(0x43800318UL)))
#define bM4_USBFS_GINTMSK_GONAKEFFM               (*((volatile unsigned int*)(0x4380031CUL)))
#define bM4_USBFS_GINTMSK_ESUSPM                  (*((volatile unsigned int*)(0x43800328UL)))
#define bM4_USBFS_GINTMSK_USBSUSPM                (*((volatile unsigned int*)(0x4380032CUL)))
#define bM4_USBFS_GINTMSK_USBRSTM                 (*((volatile unsigned int*)(0x43800330UL)))
#define bM4_USBFS_GINTMSK_ENUMDNEM                (*((volatile unsigned int*)(0x43800334UL)))
#define bM4_USBFS_GINTMSK_ISOODRPM                (*((volatile unsigned int*)(0x43800338UL)))
#define bM4_USBFS_GINTMSK_EOPFM                   (*((volatile unsigned int*)(0x4380033CUL)))
#define bM4_USBFS_GINTMSK_IEPIM                   (*((volatile unsigned int*)(0x43800348UL)))
#define bM4_USBFS_GINTMSK_OEPIM                   (*((volatile unsigned int*)(0x4380034CUL)))
#define bM4_USBFS_GINTMSK_IISOIXFRM               (*((volatile unsigned int*)(0x43800350UL)))
#define bM4_USBFS_GINTMSK_IPXFRM_INCOMPISOOUTM    (*((volatile unsigned int*)(0x43800354UL)))
#define bM4_USBFS_GINTMSK_DATAFSUSPM              (*((volatile unsigned int*)(0x43800358UL)))
#define bM4_USBFS_GINTMSK_HPRTIM                  (*((volatile unsigned int*)(0x43800360UL)))
#define bM4_USBFS_GINTMSK_HCIM                    (*((volatile unsigned int*)(0x43800364UL)))
#define bM4_USBFS_GINTMSK_PTXFEM                  (*((volatile unsigned int*)(0x43800368UL)))
#define bM4_USBFS_GINTMSK_CIDSCHGM                (*((volatile unsigned int*)(0x43800370UL)))
#define bM4_USBFS_GINTMSK_DISCIM                  (*((volatile unsigned int*)(0x43800374UL)))
#define bM4_USBFS_GINTMSK_VBUSVIM                 (*((volatile unsigned int*)(0x43800378UL)))
#define bM4_USBFS_GINTMSK_WKUIM                   (*((volatile unsigned int*)(0x4380037CUL)))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM0            (*((volatile unsigned int*)(0x43800380UL)))
