SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/common/hc32f460jcta.h
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM1            (*((volatile unsigned int*)(0x43800384UL)))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM2            (*((volatile unsigned int*)(0x43800388UL)))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM3            (*((volatile unsigned int*)(0x4380038CUL)))
#define bM4_USBFS_GRXSTSR_BCNT0                   (*((volatile unsigned int*)(0x43800390UL)))
#define bM4_USBFS_GRXSTSR_BCNT1                   (*((volatile unsigned int*)(0x43800394UL)))
#define bM4_USBFS_GRXSTSR_BCNT2                   (*((volatile unsigned int*)(0x43800398UL)))
#define bM4_USBFS_GRXSTSR_BCNT3                   (*((volatile unsigned int*)(0x4380039CUL)))
#define bM4_USBFS_GRXSTSR_BCNT4                   (*((volatile unsigned int*)(0x438003A0UL)))
#define bM4_USBFS_GRXSTSR_BCNT5                   (*((volatile unsigned int*)(0x438003A4UL)))
#define bM4_USBFS_GRXSTSR_BCNT6                   (*((volatile unsigned int*)(0x438003A8UL)))
#define bM4_USBFS_GRXSTSR_BCNT7                   (*((volatile unsigned int*)(0x438003ACUL)))
#define bM4_USBFS_GRXSTSR_BCNT8                   (*((volatile unsigned int*)(0x438003B0UL)))
#define bM4_USBFS_GRXSTSR_BCNT9                   (*((volatile unsigned int*)(0x438003B4UL)))
#define bM4_USBFS_GRXSTSR_BCNT10                  (*((volatile unsigned int*)(0x438003B8UL)))
#define bM4_USBFS_GRXSTSR_DPID0                   (*((volatile unsigned int*)(0x438003BCUL)))
#define bM4_USBFS_GRXSTSR_DPID1                   (*((volatile unsigned int*)(0x438003C0UL)))
#define bM4_USBFS_GRXSTSR_PKTSTS0                 (*((volatile unsigned int*)(0x438003C4UL)))
#define bM4_USBFS_GRXSTSR_PKTSTS1                 (*((volatile unsigned int*)(0x438003C8UL)))
#define bM4_USBFS_GRXSTSR_PKTSTS2                 (*((volatile unsigned int*)(0x438003CCUL)))
#define bM4_USBFS_GRXSTSR_PKTSTS3                 (*((volatile unsigned int*)(0x438003D0UL)))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM0            (*((volatile unsigned int*)(0x43800400UL)))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM1            (*((volatile unsigned int*)(0x43800404UL)))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM2            (*((volatile unsigned int*)(0x43800408UL)))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM3            (*((volatile unsigned int*)(0x4380040CUL)))
#define bM4_USBFS_GRXSTSP_BCNT0                   (*((volatile unsigned int*)(0x43800410UL)))
#define bM4_USBFS_GRXSTSP_BCNT1                   (*((volatile unsigned int*)(0x43800414UL)))
#define bM4_USBFS_GRXSTSP_BCNT2                   (*((volatile unsigned int*)(0x43800418UL)))
#define bM4_USBFS_GRXSTSP_BCNT3                   (*((volatile unsigned int*)(0x4380041CUL)))
#define bM4_USBFS_GRXSTSP_BCNT4                   (*((volatile unsigned int*)(0x43800420UL)))
#define bM4_USBFS_GRXSTSP_BCNT5                   (*((volatile unsigned int*)(0x43800424UL)))
#define bM4_USBFS_GRXSTSP_BCNT6                   (*((volatile unsigned int*)(0x43800428UL)))
#define bM4_USBFS_GRXSTSP_BCNT7                   (*((volatile unsigned int*)(0x4380042CUL)))
#define bM4_USBFS_GRXSTSP_BCNT8                   (*((volatile unsigned int*)(0x43800430UL)))
#define bM4_USBFS_GRXSTSP_BCNT9                   (*((volatile unsigned int*)(0x43800434UL)))
#define bM4_USBFS_GRXSTSP_BCNT10                  (*((volatile unsigned int*)(0x43800438UL)))
#define bM4_USBFS_GRXSTSP_DPID0                   (*((volatile unsigned int*)(0x4380043CUL)))
#define bM4_USBFS_GRXSTSP_DPID1                   (*((volatile unsigned int*)(0x43800440UL)))
#define bM4_USBFS_GRXSTSP_PKTSTS0                 (*((volatile unsigned int*)(0x43800444UL)))
#define bM4_USBFS_GRXSTSP_PKTSTS1                 (*((volatile unsigned int*)(0x43800448UL)))
#define bM4_USBFS_GRXSTSP_PKTSTS2                 (*((volatile unsigned int*)(0x4380044CUL)))
#define bM4_USBFS_GRXSTSP_PKTSTS3                 (*((volatile unsigned int*)(0x43800450UL)))
#define bM4_USBFS_GRXFSIZ_RXFD0                   (*((volatile unsigned int*)(0x43800480UL)))
#define bM4_USBFS_GRXFSIZ_RXFD1                   (*((volatile unsigned int*)(0x43800484UL)))
#define bM4_USBFS_GRXFSIZ_RXFD2                   (*((volatile unsigned int*)(0x43800488UL)))
#define bM4_USBFS_GRXFSIZ_RXFD3                   (*((volatile unsigned int*)(0x4380048CUL)))
#define bM4_USBFS_GRXFSIZ_RXFD4                   (*((volatile unsigned int*)(0x43800490UL)))
#define bM4_USBFS_GRXFSIZ_RXFD5                   (*((volatile unsigned int*)(0x43800494UL)))
#define bM4_USBFS_GRXFSIZ_RXFD6                   (*((volatile unsigned int*)(0x43800498UL)))
#define bM4_USBFS_GRXFSIZ_RXFD7                   (*((volatile unsigned int*)(0x4380049CUL)))
#define bM4_USBFS_GRXFSIZ_RXFD8                   (*((volatile unsigned int*)(0x438004A0UL)))
#define bM4_USBFS_GRXFSIZ_RXFD9                   (*((volatile unsigned int*)(0x438004A4UL)))
#define bM4_USBFS_GRXFSIZ_RXFD10                  (*((volatile unsigned int*)(0x438004A8UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA0              (*((volatile unsigned int*)(0x43800500UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA1              (*((volatile unsigned int*)(0x43800504UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA2              (*((volatile unsigned int*)(0x43800508UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA3              (*((volatile unsigned int*)(0x4380050CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA4              (*((volatile unsigned int*)(0x43800510UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA5              (*((volatile unsigned int*)(0x43800514UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA6              (*((volatile unsigned int*)(0x43800518UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA7              (*((volatile unsigned int*)(0x4380051CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA8              (*((volatile unsigned int*)(0x43800520UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA9              (*((volatile unsigned int*)(0x43800524UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA10             (*((volatile unsigned int*)(0x43800528UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA11             (*((volatile unsigned int*)(0x4380052CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA12             (*((volatile unsigned int*)(0x43800530UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA13             (*((volatile unsigned int*)(0x43800534UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA14             (*((volatile unsigned int*)(0x43800538UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA15             (*((volatile unsigned int*)(0x4380053CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD0               (*((volatile unsigned int*)(0x43800540UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD1               (*((volatile unsigned int*)(0x43800544UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD2               (*((volatile unsigned int*)(0x43800548UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD3               (*((volatile unsigned int*)(0x4380054CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD4               (*((volatile unsigned int*)(0x43800550UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD5               (*((volatile unsigned int*)(0x43800554UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD6               (*((volatile unsigned int*)(0x43800558UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD7               (*((volatile unsigned int*)(0x4380055CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD8               (*((volatile unsigned int*)(0x43800560UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD9               (*((volatile unsigned int*)(0x43800564UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD10              (*((volatile unsigned int*)(0x43800568UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD11              (*((volatile unsigned int*)(0x4380056CUL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD12              (*((volatile unsigned int*)(0x43800570UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD13              (*((volatile unsigned int*)(0x43800574UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD14              (*((volatile unsigned int*)(0x43800578UL)))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD15              (*((volatile unsigned int*)(0x4380057CUL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV0              (*((volatile unsigned int*)(0x43800580UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV1              (*((volatile unsigned int*)(0x43800584UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV2              (*((volatile unsigned int*)(0x43800588UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV3              (*((volatile unsigned int*)(0x4380058CUL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV4              (*((volatile unsigned int*)(0x43800590UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV5              (*((volatile unsigned int*)(0x43800594UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV6              (*((volatile unsigned int*)(0x43800598UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV7              (*((volatile unsigned int*)(0x4380059CUL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV8              (*((volatile unsigned int*)(0x438005A0UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV9              (*((volatile unsigned int*)(0x438005A4UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV10             (*((volatile unsigned int*)(0x438005A8UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV11             (*((volatile unsigned int*)(0x438005ACUL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV12             (*((volatile unsigned int*)(0x438005B0UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV13             (*((volatile unsigned int*)(0x438005B4UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV14             (*((volatile unsigned int*)(0x438005B8UL)))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV15             (*((volatile unsigned int*)(0x438005BCUL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV0              (*((volatile unsigned int*)(0x438005C0UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV1              (*((volatile unsigned int*)(0x438005C4UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV2              (*((volatile unsigned int*)(0x438005C8UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV3              (*((volatile unsigned int*)(0x438005CCUL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV4              (*((volatile unsigned int*)(0x438005D0UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV5              (*((volatile unsigned int*)(0x438005D4UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV6              (*((volatile unsigned int*)(0x438005D8UL)))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV7              (*((volatile unsigned int*)(0x438005DCUL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP0              (*((volatile unsigned int*)(0x438005E0UL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP1              (*((volatile unsigned int*)(0x438005E4UL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP2              (*((volatile unsigned int*)(0x438005E8UL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP3              (*((volatile unsigned int*)(0x438005ECUL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP4              (*((volatile unsigned int*)(0x438005F0UL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP5              (*((volatile unsigned int*)(0x438005F4UL)))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP6              (*((volatile unsigned int*)(0x438005F8UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA0                 (*((volatile unsigned int*)(0x43802000UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA1                 (*((volatile unsigned int*)(0x43802004UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA2                 (*((volatile unsigned int*)(0x43802008UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA3                 (*((volatile unsigned int*)(0x4380200CUL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA4                 (*((volatile unsigned int*)(0x43802010UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA5                 (*((volatile unsigned int*)(0x43802014UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA6                 (*((volatile unsigned int*)(0x43802018UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA7                 (*((volatile unsigned int*)(0x4380201CUL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA8                 (*((volatile unsigned int*)(0x43802020UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA9                 (*((volatile unsigned int*)(0x43802024UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA10                (*((volatile unsigned int*)(0x43802028UL)))
#define bM4_USBFS_HPTXFSIZ_PTXSA11                (*((volatile unsigned int*)(0x4380202CUL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD0                 (*((volatile unsigned int*)(0x43802040UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD1                 (*((volatile unsigned int*)(0x43802044UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD2                 (*((volatile unsigned int*)(0x43802048UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD3                 (*((volatile unsigned int*)(0x4380204CUL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD4                 (*((volatile unsigned int*)(0x43802050UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD5                 (*((volatile unsigned int*)(0x43802054UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD6                 (*((volatile unsigned int*)(0x43802058UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD7                 (*((volatile unsigned int*)(0x4380205CUL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD8                 (*((volatile unsigned int*)(0x43802060UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD9                 (*((volatile unsigned int*)(0x43802064UL)))
#define bM4_USBFS_HPTXFSIZ_PTXFD10                (*((volatile unsigned int*)(0x43802068UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA0              (*((volatile unsigned int*)(0x43802080UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA1              (*((volatile unsigned int*)(0x43802084UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA2              (*((volatile unsigned int*)(0x43802088UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA3              (*((volatile unsigned int*)(0x4380208CUL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA4              (*((volatile unsigned int*)(0x43802090UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA5              (*((volatile unsigned int*)(0x43802094UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA6              (*((volatile unsigned int*)(0x43802098UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA7              (*((volatile unsigned int*)(0x4380209CUL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA8              (*((volatile unsigned int*)(0x438020A0UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA9              (*((volatile unsigned int*)(0x438020A4UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA10             (*((volatile unsigned int*)(0x438020A8UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXSA11             (*((volatile unsigned int*)(0x438020ACUL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD0              (*((volatile unsigned int*)(0x438020C0UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD1              (*((volatile unsigned int*)(0x438020C4UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD2              (*((volatile unsigned int*)(0x438020C8UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD3              (*((volatile unsigned int*)(0x438020CCUL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD4              (*((volatile unsigned int*)(0x438020D0UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD5              (*((volatile unsigned int*)(0x438020D4UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD6              (*((volatile unsigned int*)(0x438020D8UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD7              (*((volatile unsigned int*)(0x438020DCUL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD8              (*((volatile unsigned int*)(0x438020E0UL)))
#define bM4_USBFS_DIEPTXF1_INEPTXFD9              (*((volatile unsigned int*)(0x438020E4UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA0              (*((volatile unsigned int*)(0x43802100UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA1              (*((volatile unsigned int*)(0x43802104UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA2              (*((volatile unsigned int*)(0x43802108UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA3              (*((volatile unsigned int*)(0x4380210CUL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA4              (*((volatile unsigned int*)(0x43802110UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA5              (*((volatile unsigned int*)(0x43802114UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA6              (*((volatile unsigned int*)(0x43802118UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA7              (*((volatile unsigned int*)(0x4380211CUL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA8              (*((volatile unsigned int*)(0x43802120UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA9              (*((volatile unsigned int*)(0x43802124UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA10             (*((volatile unsigned int*)(0x43802128UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXSA11             (*((volatile unsigned int*)(0x4380212CUL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD0              (*((volatile unsigned int*)(0x43802140UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD1              (*((volatile unsigned int*)(0x43802144UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD2              (*((volatile unsigned int*)(0x43802148UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD3              (*((volatile unsigned int*)(0x4380214CUL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD4              (*((volatile unsigned int*)(0x43802150UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD5              (*((volatile unsigned int*)(0x43802154UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD6              (*((volatile unsigned int*)(0x43802158UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD7              (*((volatile unsigned int*)(0x4380215CUL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD8              (*((volatile unsigned int*)(0x43802160UL)))
#define bM4_USBFS_DIEPTXF2_INEPTXFD9              (*((volatile unsigned int*)(0x43802164UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA0              (*((volatile unsigned int*)(0x43802180UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA1              (*((volatile unsigned int*)(0x43802184UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA2              (*((volatile unsigned int*)(0x43802188UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA3              (*((volatile unsigned int*)(0x4380218CUL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA4              (*((volatile unsigned int*)(0x43802190UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA5              (*((volatile unsigned int*)(0x43802194UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA6              (*((volatile unsigned int*)(0x43802198UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA7              (*((volatile unsigned int*)(0x4380219CUL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA8              (*((volatile unsigned int*)(0x438021A0UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA9              (*((volatile unsigned int*)(0x438021A4UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA10             (*((volatile unsigned int*)(0x438021A8UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXSA11             (*((volatile unsigned int*)(0x438021ACUL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD0              (*((volatile unsigned int*)(0x438021C0UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD1              (*((volatile unsigned int*)(0x438021C4UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD2              (*((volatile unsigned int*)(0x438021C8UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD3              (*((volatile unsigned int*)(0x438021CCUL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD4              (*((volatile unsigned int*)(0x438021D0UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD5              (*((volatile unsigned int*)(0x438021D4UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD6              (*((volatile unsigned int*)(0x438021D8UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD7              (*((volatile unsigned int*)(0x438021DCUL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD8              (*((volatile unsigned int*)(0x438021E0UL)))
#define bM4_USBFS_DIEPTXF3_INEPTXFD9              (*((volatile unsigned int*)(0x438021E4UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA0              (*((volatile unsigned int*)(0x43802200UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA1              (*((volatile unsigned int*)(0x43802204UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA2              (*((volatile unsigned int*)(0x43802208UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA3              (*((volatile unsigned int*)(0x4380220CUL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA4              (*((volatile unsigned int*)(0x43802210UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA5              (*((volatile unsigned int*)(0x43802214UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA6              (*((volatile unsigned int*)(0x43802218UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA7              (*((volatile unsigned int*)(0x4380221CUL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA8              (*((volatile unsigned int*)(0x43802220UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA9              (*((volatile unsigned int*)(0x43802224UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA10             (*((volatile unsigned int*)(0x43802228UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXSA11             (*((volatile unsigned int*)(0x4380222CUL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD0              (*((volatile unsigned int*)(0x43802240UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD1              (*((volatile unsigned int*)(0x43802244UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD2              (*((volatile unsigned int*)(0x43802248UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD3              (*((volatile unsigned int*)(0x4380224CUL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD4              (*((volatile unsigned int*)(0x43802250UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD5              (*((volatile unsigned int*)(0x43802254UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD6              (*((volatile unsigned int*)(0x43802258UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD7              (*((volatile unsigned int*)(0x4380225CUL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD8              (*((volatile unsigned int*)(0x43802260UL)))
#define bM4_USBFS_DIEPTXF4_INEPTXFD9              (*((volatile unsigned int*)(0x43802264UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA0              (*((volatile unsigned int*)(0x43802280UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA1              (*((volatile unsigned int*)(0x43802284UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA2              (*((volatile unsigned int*)(0x43802288UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA3              (*((volatile unsigned int*)(0x4380228CUL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA4              (*((volatile unsigned int*)(0x43802290UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA5              (*((volatile unsigned int*)(0x43802294UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA6              (*((volatile unsigned int*)(0x43802298UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA7              (*((volatile unsigned int*)(0x4380229CUL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA8              (*((volatile unsigned int*)(0x438022A0UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA9              (*((volatile unsigned int*)(0x438022A4UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA10             (*((volatile unsigned int*)(0x438022A8UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXSA11             (*((volatile unsigned int*)(0x438022ACUL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD0              (*((volatile unsigned int*)(0x438022C0UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD1              (*((volatile unsigned int*)(0x438022C4UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD2              (*((volatile unsigned int*)(0x438022C8UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD3              (*((volatile unsigned int*)(0x438022CCUL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD4              (*((volatile unsigned int*)(0x438022D0UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD5              (*((volatile unsigned int*)(0x438022D4UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD6              (*((volatile unsigned int*)(0x438022D8UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD7              (*((volatile unsigned int*)(0x438022DCUL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD8              (*((volatile unsigned int*)(0x438022E0UL)))
#define bM4_USBFS_DIEPTXF5_INEPTXFD9              (*((volatile unsigned int*)(0x438022E4UL)))
#define bM4_USBFS_HCFG_FSLSPCS0                   (*((volatile unsigned int*)(0x43808000UL)))
#define bM4_USBFS_HCFG_FSLSPCS1                   (*((volatile unsigned int*)(0x43808004UL)))
#define bM4_USBFS_HCFG_FSLSS                      (*((volatile unsigned int*)(0x43808008UL)))
#define bM4_USBFS_HFIR_FRIVL0                     (*((volatile unsigned int*)(0x43808080UL)))
#define bM4_USBFS_HFIR_FRIVL1                     (*((volatile unsigned int*)(0x43808084UL)))
#define bM4_USBFS_HFIR_FRIVL2                     (*((volatile unsigned int*)(0x43808088UL)))
#define bM4_USBFS_HFIR_FRIVL3                     (*((volatile unsigned int*)(0x4380808CUL)))
