SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/common/hc32f460jcta.h
#define bM4_USBFS_HCTSIZ11_XFRSIZ3                (*((volatile unsigned int*)(0x4380CE0CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ4                (*((volatile unsigned int*)(0x4380CE10UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ5                (*((volatile unsigned int*)(0x4380CE14UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ6                (*((volatile unsigned int*)(0x4380CE18UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ7                (*((volatile unsigned int*)(0x4380CE1CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ8                (*((volatile unsigned int*)(0x4380CE20UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ9                (*((volatile unsigned int*)(0x4380CE24UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ10               (*((volatile unsigned int*)(0x4380CE28UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ11               (*((volatile unsigned int*)(0x4380CE2CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ12               (*((volatile unsigned int*)(0x4380CE30UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ13               (*((volatile unsigned int*)(0x4380CE34UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ14               (*((volatile unsigned int*)(0x4380CE38UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ15               (*((volatile unsigned int*)(0x4380CE3CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ16               (*((volatile unsigned int*)(0x4380CE40UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ17               (*((volatile unsigned int*)(0x4380CE44UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ18               (*((volatile unsigned int*)(0x4380CE48UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT0                (*((volatile unsigned int*)(0x4380CE4CUL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT1                (*((volatile unsigned int*)(0x4380CE50UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT2                (*((volatile unsigned int*)(0x4380CE54UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT3                (*((volatile unsigned int*)(0x4380CE58UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT4                (*((volatile unsigned int*)(0x4380CE5CUL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT5                (*((volatile unsigned int*)(0x4380CE60UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT6                (*((volatile unsigned int*)(0x4380CE64UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT7                (*((volatile unsigned int*)(0x4380CE68UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT8                (*((volatile unsigned int*)(0x4380CE6CUL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT9                (*((volatile unsigned int*)(0x4380CE70UL)))
#define bM4_USBFS_HCTSIZ11_DPID0                  (*((volatile unsigned int*)(0x4380CE74UL)))
#define bM4_USBFS_HCTSIZ11_DPID1                  (*((volatile unsigned int*)(0x4380CE78UL)))
#define bM4_USBFS_DCFG_DSPD0                      (*((volatile unsigned int*)(0x43810000UL)))
#define bM4_USBFS_DCFG_DSPD1                      (*((volatile unsigned int*)(0x43810004UL)))
#define bM4_USBFS_DCFG_NZLSOHSK                   (*((volatile unsigned int*)(0x43810008UL)))
#define bM4_USBFS_DCFG_DAD0                       (*((volatile unsigned int*)(0x43810010UL)))
#define bM4_USBFS_DCFG_DAD1                       (*((volatile unsigned int*)(0x43810014UL)))
#define bM4_USBFS_DCFG_DAD2                       (*((volatile unsigned int*)(0x43810018UL)))
#define bM4_USBFS_DCFG_DAD3                       (*((volatile unsigned int*)(0x4381001CUL)))
#define bM4_USBFS_DCFG_DAD4                       (*((volatile unsigned int*)(0x43810020UL)))
#define bM4_USBFS_DCFG_DAD5                       (*((volatile unsigned int*)(0x43810024UL)))
#define bM4_USBFS_DCFG_DAD6                       (*((volatile unsigned int*)(0x43810028UL)))
#define bM4_USBFS_DCFG_PFIVL0                     (*((volatile unsigned int*)(0x4381002CUL)))
#define bM4_USBFS_DCFG_PFIVL1                     (*((volatile unsigned int*)(0x43810030UL)))
#define bM4_USBFS_DCTL_RWUSIG                     (*((volatile unsigned int*)(0x43810080UL)))
#define bM4_USBFS_DCTL_SDIS                       (*((volatile unsigned int*)(0x43810084UL)))
#define bM4_USBFS_DCTL_GINSTS                     (*((volatile unsigned int*)(0x43810088UL)))
#define bM4_USBFS_DCTL_GONSTS                     (*((volatile unsigned int*)(0x4381008CUL)))
#define bM4_USBFS_DCTL_SGINAK                     (*((volatile unsigned int*)(0x4381009CUL)))
#define bM4_USBFS_DCTL_CGINAK                     (*((volatile unsigned int*)(0x438100A0UL)))
#define bM4_USBFS_DCTL_SGONAK                     (*((volatile unsigned int*)(0x438100A4UL)))
#define bM4_USBFS_DCTL_CGONAK                     (*((volatile unsigned int*)(0x438100A8UL)))
#define bM4_USBFS_DCTL_POPRGDNE                   (*((volatile unsigned int*)(0x438100ACUL)))
#define bM4_USBFS_DSTS_SUSPSTS                    (*((volatile unsigned int*)(0x43810100UL)))
#define bM4_USBFS_DSTS_ENUMSPD0                   (*((volatile unsigned int*)(0x43810104UL)))
#define bM4_USBFS_DSTS_ENUMSPD1                   (*((volatile unsigned int*)(0x43810108UL)))
#define bM4_USBFS_DSTS_EERR                       (*((volatile unsigned int*)(0x4381010CUL)))
#define bM4_USBFS_DSTS_FNSOF0                     (*((volatile unsigned int*)(0x43810120UL)))
#define bM4_USBFS_DSTS_FNSOF1                     (*((volatile unsigned int*)(0x43810124UL)))
#define bM4_USBFS_DSTS_FNSOF2                     (*((volatile unsigned int*)(0x43810128UL)))
#define bM4_USBFS_DSTS_FNSOF3                     (*((volatile unsigned int*)(0x4381012CUL)))
#define bM4_USBFS_DSTS_FNSOF4                     (*((volatile unsigned int*)(0x43810130UL)))
#define bM4_USBFS_DSTS_FNSOF5                     (*((volatile unsigned int*)(0x43810134UL)))
#define bM4_USBFS_DSTS_FNSOF6                     (*((volatile unsigned int*)(0x43810138UL)))
#define bM4_USBFS_DSTS_FNSOF7                     (*((volatile unsigned int*)(0x4381013CUL)))
#define bM4_USBFS_DSTS_FNSOF8                     (*((volatile unsigned int*)(0x43810140UL)))
#define bM4_USBFS_DSTS_FNSOF9                     (*((volatile unsigned int*)(0x43810144UL)))
#define bM4_USBFS_DSTS_FNSOF10                    (*((volatile unsigned int*)(0x43810148UL)))
#define bM4_USBFS_DSTS_FNSOF11                    (*((volatile unsigned int*)(0x4381014CUL)))
#define bM4_USBFS_DSTS_FNSOF12                    (*((volatile unsigned int*)(0x43810150UL)))
#define bM4_USBFS_DSTS_FNSOF13                    (*((volatile unsigned int*)(0x43810154UL)))
#define bM4_USBFS_DIEPMSK_XFRCM                   (*((volatile unsigned int*)(0x43810200UL)))
#define bM4_USBFS_DIEPMSK_EPDM                    (*((volatile unsigned int*)(0x43810204UL)))
#define bM4_USBFS_DIEPMSK_TOM                     (*((volatile unsigned int*)(0x4381020CUL)))
#define bM4_USBFS_DIEPMSK_ITTXFEMSK               (*((volatile unsigned int*)(0x43810210UL)))
#define bM4_USBFS_DIEPMSK_INEPNMM                 (*((volatile unsigned int*)(0x43810214UL)))
#define bM4_USBFS_DIEPMSK_INEPNEM                 (*((volatile unsigned int*)(0x43810218UL)))
#define bM4_USBFS_DOEPMSK_XFRCM                   (*((volatile unsigned int*)(0x43810280UL)))
#define bM4_USBFS_DOEPMSK_EPDM                    (*((volatile unsigned int*)(0x43810284UL)))
#define bM4_USBFS_DOEPMSK_STUPM                   (*((volatile unsigned int*)(0x4381028CUL)))
#define bM4_USBFS_DOEPMSK_OTEPDM                  (*((volatile unsigned int*)(0x43810290UL)))
#define bM4_USBFS_DAINT_IEPINT0                   (*((volatile unsigned int*)(0x43810300UL)))
#define bM4_USBFS_DAINT_IEPINT1                   (*((volatile unsigned int*)(0x43810304UL)))
#define bM4_USBFS_DAINT_IEPINT2                   (*((volatile unsigned int*)(0x43810308UL)))
#define bM4_USBFS_DAINT_IEPINT3                   (*((volatile unsigned int*)(0x4381030CUL)))
#define bM4_USBFS_DAINT_IEPINT4                   (*((volatile unsigned int*)(0x43810310UL)))
#define bM4_USBFS_DAINT_IEPINT5                   (*((volatile unsigned int*)(0x43810314UL)))
#define bM4_USBFS_DAINT_OEPINT0                   (*((volatile unsigned int*)(0x43810340UL)))
#define bM4_USBFS_DAINT_OEPINT1                   (*((volatile unsigned int*)(0x43810344UL)))
#define bM4_USBFS_DAINT_OEPINT2                   (*((volatile unsigned int*)(0x43810348UL)))
#define bM4_USBFS_DAINT_OEPINT3                   (*((volatile unsigned int*)(0x4381034CUL)))
#define bM4_USBFS_DAINT_OEPINT4                   (*((volatile unsigned int*)(0x43810350UL)))
#define bM4_USBFS_DAINT_OEPINT5                   (*((volatile unsigned int*)(0x43810354UL)))
#define bM4_USBFS_DAINTMSK_IEPINTM0               (*((volatile unsigned int*)(0x43810380UL)))
#define bM4_USBFS_DAINTMSK_IEPINTM1               (*((volatile unsigned int*)(0x43810384UL)))
#define bM4_USBFS_DAINTMSK_IEPINTM2               (*((volatile unsigned int*)(0x43810388UL)))
#define bM4_USBFS_DAINTMSK_IEPINTM3               (*((volatile unsigned int*)(0x4381038CUL)))
#define bM4_USBFS_DAINTMSK_IEPINTM4               (*((volatile unsigned int*)(0x43810390UL)))
#define bM4_USBFS_DAINTMSK_IEPINTM5               (*((volatile unsigned int*)(0x43810394UL)))
#define bM4_USBFS_DAINTMSK_OEPINTM0               (*((volatile unsigned int*)(0x438103C0UL)))
#define bM4_USBFS_DAINTMSK_OEPINTM1               (*((volatile unsigned int*)(0x438103C4UL)))
#define bM4_USBFS_DAINTMSK_OEPINTM2               (*((volatile unsigned int*)(0x438103C8UL)))
#define bM4_USBFS_DAINTMSK_OEPINTM3               (*((volatile unsigned int*)(0x438103CCUL)))
#define bM4_USBFS_DAINTMSK_OEPINTM4               (*((volatile unsigned int*)(0x438103D0UL)))
#define bM4_USBFS_DAINTMSK_OEPINTM5               (*((volatile unsigned int*)(0x438103D4UL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM0           (*((volatile unsigned int*)(0x43810680UL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM1           (*((volatile unsigned int*)(0x43810684UL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM2           (*((volatile unsigned int*)(0x43810688UL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM3           (*((volatile unsigned int*)(0x4381068CUL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM4           (*((volatile unsigned int*)(0x43810690UL)))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM5           (*((volatile unsigned int*)(0x43810694UL)))
#define bM4_USBFS_DIEPCTL0_MPSIZ0                 (*((volatile unsigned int*)(0x43812000UL)))
#define bM4_USBFS_DIEPCTL0_MPSIZ1                 (*((volatile unsigned int*)(0x43812004UL)))
#define bM4_USBFS_DIEPCTL0_USBAEP                 (*((volatile unsigned int*)(0x4381203CUL)))
#define bM4_USBFS_DIEPCTL0_NAKSTS                 (*((volatile unsigned int*)(0x43812044UL)))
#define bM4_USBFS_DIEPCTL0_EPTYP0                 (*((volatile unsigned int*)(0x43812048UL)))
#define bM4_USBFS_DIEPCTL0_EPTYP1                 (*((volatile unsigned int*)(0x4381204CUL)))
#define bM4_USBFS_DIEPCTL0_STALL                  (*((volatile unsigned int*)(0x43812054UL)))
#define bM4_USBFS_DIEPCTL0_TXFNUM0                (*((volatile unsigned int*)(0x43812058UL)))
#define bM4_USBFS_DIEPCTL0_TXFNUM1                (*((volatile unsigned int*)(0x4381205CUL)))
#define bM4_USBFS_DIEPCTL0_TXFNUM2                (*((volatile unsigned int*)(0x43812060UL)))
#define bM4_USBFS_DIEPCTL0_TXFNUM3                (*((volatile unsigned int*)(0x43812064UL)))
#define bM4_USBFS_DIEPCTL0_CNAK                   (*((volatile unsigned int*)(0x43812068UL)))
#define bM4_USBFS_DIEPCTL0_SNAK                   (*((volatile unsigned int*)(0x4381206CUL)))
#define bM4_USBFS_DIEPCTL0_EPDIS                  (*((volatile unsigned int*)(0x43812078UL)))
#define bM4_USBFS_DIEPCTL0_EPENA                  (*((volatile unsigned int*)(0x4381207CUL)))
#define bM4_USBFS_DIEPINT0_XFRC                   (*((volatile unsigned int*)(0x43812100UL)))
#define bM4_USBFS_DIEPINT0_EPDISD                 (*((volatile unsigned int*)(0x43812104UL)))
#define bM4_USBFS_DIEPINT0_TOC                    (*((volatile unsigned int*)(0x4381210CUL)))
#define bM4_USBFS_DIEPINT0_TTXFE                  (*((volatile unsigned int*)(0x43812110UL)))
#define bM4_USBFS_DIEPINT0_INEPNE                 (*((volatile unsigned int*)(0x43812118UL)))
#define bM4_USBFS_DIEPINT0_TXFE                   (*((volatile unsigned int*)(0x4381211CUL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ0               (*((volatile unsigned int*)(0x43812200UL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ1               (*((volatile unsigned int*)(0x43812204UL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ2               (*((volatile unsigned int*)(0x43812208UL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ3               (*((volatile unsigned int*)(0x4381220CUL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ4               (*((volatile unsigned int*)(0x43812210UL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ5               (*((volatile unsigned int*)(0x43812214UL)))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ6               (*((volatile unsigned int*)(0x43812218UL)))
#define bM4_USBFS_DIEPTSIZ0_PKTCNT0               (*((volatile unsigned int*)(0x4381224CUL)))
#define bM4_USBFS_DIEPTSIZ0_PKTCNT1               (*((volatile unsigned int*)(0x43812250UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV0             (*((volatile unsigned int*)(0x43812300UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV1             (*((volatile unsigned int*)(0x43812304UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV2             (*((volatile unsigned int*)(0x43812308UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV3             (*((volatile unsigned int*)(0x4381230CUL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV4             (*((volatile unsigned int*)(0x43812310UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV5             (*((volatile unsigned int*)(0x43812314UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV6             (*((volatile unsigned int*)(0x43812318UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV7             (*((volatile unsigned int*)(0x4381231CUL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV8             (*((volatile unsigned int*)(0x43812320UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV9             (*((volatile unsigned int*)(0x43812324UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV10            (*((volatile unsigned int*)(0x43812328UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV11            (*((volatile unsigned int*)(0x4381232CUL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV12            (*((volatile unsigned int*)(0x43812330UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV13            (*((volatile unsigned int*)(0x43812334UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV14            (*((volatile unsigned int*)(0x43812338UL)))
#define bM4_USBFS_DTXFSTS0_INEPTFSAV15            (*((volatile unsigned int*)(0x4381233CUL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ0                 (*((volatile unsigned int*)(0x43812400UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ1                 (*((volatile unsigned int*)(0x43812404UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ2                 (*((volatile unsigned int*)(0x43812408UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ3                 (*((volatile unsigned int*)(0x4381240CUL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ4                 (*((volatile unsigned int*)(0x43812410UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ5                 (*((volatile unsigned int*)(0x43812414UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ6                 (*((volatile unsigned int*)(0x43812418UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ7                 (*((volatile unsigned int*)(0x4381241CUL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ8                 (*((volatile unsigned int*)(0x43812420UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ9                 (*((volatile unsigned int*)(0x43812424UL)))
#define bM4_USBFS_DIEPCTL1_MPSIZ10                (*((volatile unsigned int*)(0x43812428UL)))
#define bM4_USBFS_DIEPCTL1_USBAEP                 (*((volatile unsigned int*)(0x4381243CUL)))
#define bM4_USBFS_DIEPCTL1_EONUM_DPID             (*((volatile unsigned int*)(0x43812440UL)))
#define bM4_USBFS_DIEPCTL1_NAKSTS                 (*((volatile unsigned int*)(0x43812444UL)))
#define bM4_USBFS_DIEPCTL1_EPTYP0                 (*((volatile unsigned int*)(0x43812448UL)))
#define bM4_USBFS_DIEPCTL1_EPTYP1                 (*((volatile unsigned int*)(0x4381244CUL)))
#define bM4_USBFS_DIEPCTL1_STALL                  (*((volatile unsigned int*)(0x43812454UL)))
#define bM4_USBFS_DIEPCTL1_TXFNUM0                (*((volatile unsigned int*)(0x43812458UL)))
#define bM4_USBFS_DIEPCTL1_TXFNUM1                (*((volatile unsigned int*)(0x4381245CUL)))
#define bM4_USBFS_DIEPCTL1_TXFNUM2                (*((volatile unsigned int*)(0x43812460UL)))
#define bM4_USBFS_DIEPCTL1_TXFNUM3                (*((volatile unsigned int*)(0x43812464UL)))
#define bM4_USBFS_DIEPCTL1_CNAK                   (*((volatile unsigned int*)(0x43812468UL)))
#define bM4_USBFS_DIEPCTL1_SNAK                   (*((volatile unsigned int*)(0x4381246CUL)))
#define bM4_USBFS_DIEPCTL1_SD0PID_SEVNFRM         (*((volatile unsigned int*)(0x43812470UL)))
#define bM4_USBFS_DIEPCTL1_SODDFRM                (*((volatile unsigned int*)(0x43812474UL)))
#define bM4_USBFS_DIEPCTL1_EPDIS                  (*((volatile unsigned int*)(0x43812478UL)))
#define bM4_USBFS_DIEPCTL1_EPENA                  (*((volatile unsigned int*)(0x4381247CUL)))
#define bM4_USBFS_DIEPINT1_XFRC                   (*((volatile unsigned int*)(0x43812500UL)))
#define bM4_USBFS_DIEPINT1_EPDISD                 (*((volatile unsigned int*)(0x43812504UL)))
#define bM4_USBFS_DIEPINT1_TOC                    (*((volatile unsigned int*)(0x4381250CUL)))
#define bM4_USBFS_DIEPINT1_TTXFE                  (*((volatile unsigned int*)(0x43812510UL)))
#define bM4_USBFS_DIEPINT1_INEPNE                 (*((volatile unsigned int*)(0x43812518UL)))
#define bM4_USBFS_DIEPINT1_TXFE                   (*((volatile unsigned int*)(0x4381251CUL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ0               (*((volatile unsigned int*)(0x43812600UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ1               (*((volatile unsigned int*)(0x43812604UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ2               (*((volatile unsigned int*)(0x43812608UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ3               (*((volatile unsigned int*)(0x4381260CUL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ4               (*((volatile unsigned int*)(0x43812610UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ5               (*((volatile unsigned int*)(0x43812614UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ6               (*((volatile unsigned int*)(0x43812618UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ7               (*((volatile unsigned int*)(0x4381261CUL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ8               (*((volatile unsigned int*)(0x43812620UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ9               (*((volatile unsigned int*)(0x43812624UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ10              (*((volatile unsigned int*)(0x43812628UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ11              (*((volatile unsigned int*)(0x4381262CUL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ12              (*((volatile unsigned int*)(0x43812630UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ13              (*((volatile unsigned int*)(0x43812634UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ14              (*((volatile unsigned int*)(0x43812638UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ15              (*((volatile unsigned int*)(0x4381263CUL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ16              (*((volatile unsigned int*)(0x43812640UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ17              (*((volatile unsigned int*)(0x43812644UL)))
#define bM4_USBFS_DIEPTSIZ1_XFRSIZ18              (*((volatile unsigned int*)(0x43812648UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT0               (*((volatile unsigned int*)(0x4381264CUL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT1               (*((volatile unsigned int*)(0x43812650UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT2               (*((volatile unsigned int*)(0x43812654UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT3               (*((volatile unsigned int*)(0x43812658UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT4               (*((volatile unsigned int*)(0x4381265CUL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT5               (*((volatile unsigned int*)(0x43812660UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT6               (*((volatile unsigned int*)(0x43812664UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT7               (*((volatile unsigned int*)(0x43812668UL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT8               (*((volatile unsigned int*)(0x4381266CUL)))
#define bM4_USBFS_DIEPTSIZ1_PKTCNT9               (*((volatile unsigned int*)(0x43812670UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV0             (*((volatile unsigned int*)(0x43812700UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV1             (*((volatile unsigned int*)(0x43812704UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV2             (*((volatile unsigned int*)(0x43812708UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV3             (*((volatile unsigned int*)(0x4381270CUL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV4             (*((volatile unsigned int*)(0x43812710UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV5             (*((volatile unsigned int*)(0x43812714UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV6             (*((volatile unsigned int*)(0x43812718UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV7             (*((volatile unsigned int*)(0x4381271CUL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV8             (*((volatile unsigned int*)(0x43812720UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV9             (*((volatile unsigned int*)(0x43812724UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV10            (*((volatile unsigned int*)(0x43812728UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV11            (*((volatile unsigned int*)(0x4381272CUL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV12            (*((volatile unsigned int*)(0x43812730UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV13            (*((volatile unsigned int*)(0x43812734UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV14            (*((volatile unsigned int*)(0x43812738UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV15            (*((volatile unsigned int*)(0x4381273CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ0                 (*((volatile unsigned int*)(0x43812800UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ1                 (*((volatile unsigned int*)(0x43812804UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ2                 (*((volatile unsigned int*)(0x43812808UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ3                 (*((volatile unsigned int*)(0x4381280CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ4                 (*((volatile unsigned int*)(0x43812810UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ5                 (*((volatile unsigned int*)(0x43812814UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ6                 (*((volatile unsigned int*)(0x43812818UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ7                 (*((volatile unsigned int*)(0x4381281CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ8                 (*((volatile unsigned int*)(0x43812820UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ9                 (*((volatile unsigned int*)(0x43812824UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ10                (*((volatile unsigned int*)(0x43812828UL)))
#define bM4_USBFS_DIEPCTL2_USBAEP                 (*((volatile unsigned int*)(0x4381283CUL)))
#define bM4_USBFS_DIEPCTL2_EONUM_DPID             (*((volatile unsigned int*)(0x43812840UL)))
#define bM4_USBFS_DIEPCTL2_NAKSTS                 (*((volatile unsigned int*)(0x43812844UL)))
#define bM4_USBFS_DIEPCTL2_EPTYP0                 (*((volatile unsigned int*)(0x43812848UL)))
#define bM4_USBFS_DIEPCTL2_EPTYP1                 (*((volatile unsigned int*)(0x4381284CUL)))
#define bM4_USBFS_DIEPCTL2_STALL                  (*((volatile unsigned int*)(0x43812854UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM0                (*((volatile unsigned int*)(0x43812858UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM1                (*((volatile unsigned int*)(0x4381285CUL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM2                (*((volatile unsigned int*)(0x43812860UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM3                (*((volatile unsigned int*)(0x43812864UL)))
#define bM4_USBFS_DIEPCTL2_CNAK                   (*((volatile unsigned int*)(0x43812868UL)))
#define bM4_USBFS_DIEPCTL2_SNAK                   (*((volatile unsigned int*)(0x4381286CUL)))
#define bM4_USBFS_DIEPCTL2_SD0PID_SEVNFRM         (*((volatile unsigned int*)(0x43812870UL)))
